{
    "url": "https://companieshouse.blog.gov.uk/2023/01/10/protecting-your-personal-information-on-the-companies-house-register/",
    "title": "Protecting your personal information on the Companies House register",
    "authors": [
        "Mark Sly - Senior Policy Advisor"
    ],
    "categories": [
        "Company guidance",
        "Legislative reform"
    ],
    "pub_date": "2023-01-10T14:42:20+00:00",
    "content": [
        {
            "text": "As part of the Economic Crime and Corporate Transparency Bill, the government will introduce measures to prevent abuse of personal information held on the Companies House register."
        },
        {
            "text": "One of the key principles of corporate transparency is that individuals running companies should register certain details so they can be held accountable for the running of their company. However, we know that publishing this personal information in the public domain can lead to the risk of fraud, identity theft or other harm. One of the aims of the Economic Crime and Corporate Transparency Bill is to balance the need for corporate transparency with the understanding that personal information should only be published when it’s necessary and proportionate to do so. We want to make sure the register does not become a tool for abuse of personal information. "
        },
        {
            "heading": 2,
            "text": "Suppression of personal information "
        },
        {
            "text": "Currently, individuals can apply to suppress their residential address if it’s shown as their service address. Under the new measures, individuals will also be able to apply to suppress the following information from historical documents once secondary legislation is made:"
        },
        {
            "text": "Suppression will be automatic on application. You will not need to supply any evidence."
        },
        {
            "heading": 2,
            "text": "Protection of personal information because of risk of harm "
        },
        {
            "text": "We’re also improving the protection regime so that individuals at personal risk of physical harm or violence as a result of their personal information being on our public registers (for example, domestic abuse survivors) can apply to have their information protected from public view. The application process will be set out in secondary legislation, but we expect that people will need to provide evidence before their information is protected – such as supporting correspondence from the police or a charity caseworker."
        },
        {
            "text": "The information that can be protected from public view includes:"
        },
        {
            "heading": 2,
            "text": "The application process "
        },
        {
            "text": "Any applications made under any of the above measures will be subject to a fee."
        },
        {
            "text": "There’ll be some circumstances where we will not suppress information unless alternative information is given beforehand. For example, a current registered office address will only be suppressed if an alternative address is provided. Another example is when an individual has changed their name because of being at risk of harm. We'll only protect the previous name once a new name has been given."
        },
        {
            "text": "We expect the new measures to be open to any individual from any company or other entity whose personal information appears on our registers. The individual will be responsible for identifying where their personal information is displayed on the register (or registers)."
        },
        {
            "text": "We’ll put safeguards in place to make sure these new measures are not abused. We’ll be able to ask for more details before suppressing information, for example, if we believe the application is for the suppression of a business address rather than a residential address. If we find out that the original application contained false or misleading information, we’ll have the power to revoke any protection granted."
        },
        {
            "heading": 2,
            "text": "Access to suppressed information "
        },
        {
            "text": "Any information suppressed under the new measures will still be available to law enforcement agencies. Some of the measures in the Economic Crime and Corporate Transparency Bill will give Companies House greater data-sharing powers, which means we’ll be able to proactively share any suppressed and protected information with law enforcement agencies if deemed proportionate and necessary."
        },
        {
            "text": "We expect that some information (for example, suppressed registered office addresses) will be made available in certain other circumstances, such as if they’re needed for prospective legal proceedings or if a public interest application is made to the court. These circumstances will be fully set out in secondary legislation."
        },
        {
            "text": "These measures will all need secondary legislation and system development before they’re implemented. We do not have a timeframe for the implementation of these measures yet, but we’ll keep you updated on our channels."
        }
    ]
}