{
    "url": "https://educationhub.blog.gov.uk/2023/01/10/the-deadline-for-primary-school-applications-is-sunday-15-january-heres-what-you-need-to-know/",
    "title": "The deadline for primary school applications is Sunday 15 January: Here’s what you need to know",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Primary Schools"
    ],
    "pub_date": "2023-01-10T16:51:42+00:00",
    "content": [
        {
            "text": "Sunday 15 January is the deadline for primary school applications."
        },
        {
            "text": "Parents with children due to start school in September 2023 need to go through their local authority to apply for places at their chosen primary schools."
        },
        {
            "text": "Parents can express a preference for at least three schools in some areas and up to six schools in others. We recommend parents express a preference for as many schools as their local application allows."
        },
        {
            "text": "Although this can be an anxious time for parents, last year 92.2% of families were offered their first-choice primary school and 98.1% received offers from one of their top three choices."
        },
        {
            "text": "Parents can also feel reassured that the proportion of schools which are good or outstanding is higher than it was 10 years ago – 88% now compared to 68% in 2010."
        },
        {
            "text": "To apply for a place for your child visit the school admissions section of your local authority’s website. You can find your local authority by entering your postcode here: Find your local council - GOV.UK (www.gov.uk)."
        },
        {
            "text": "School places are allocated in line with published admissions criteria – all those who apply on time will be considered together and for oversubscribed schools, places will be offered to the children who most closely meet the oversubscription criteria."
        },
        {
            "text": "Any applications which arrive late may be considered after those which were submitted by the deadline."
        }
    ]
}