{
    "url": "https://insideDIO.blog.gov.uk/2023/01/10/the-eagle-has-landed-rare-bird-returns-to-lulworth-ranges/",
    "title": "The eagle has landed: rare bird returns to Lulworth Ranges",
    "authors": [
        "Olly Howells"
    ],
    "categories": [
        "Defence Training Estate (DTE)",
        "Environment and Ecology",
        "Lulworth Training Area"
    ],
    "pub_date": "2023-01-10T17:29:44+00:00",
    "content": [
        {
            "text": "The white-tailed eagle or sea eagle is Britain’s largest bird of prey, and was once widespread along the south coast of England before being driven to extinction by human persecution."
        },
        {
            "text": "To restore this lost species, Forestry England and the Roy Dennis Wildlife Foundation embarked on a landmark conservation project in 2019. The project is re-establishing a population of white-tailed eagles in parts of southern England which remain highly suitable for the species – including MOD sites such as Lulworth Ranges, where we were delighted to recently learn that two of the released birds have been spending a considerable amount of time."
        },
        {
            "heading": 2,
            "text": "About the project"
        },
        {
            "text": "The Isle of Wight, which was the last known breeding site of the white-tailed eagle in southern England in the 18th Century, was selected as an ideal site from which to release the birds back into the wild. Six eagles were initially released in 2019, with the aim to release up to 60 birds over a five-year period and establish several breeding pairs along the south coast."
        },
        {
            "text": "From their central location on the Isle of Wight, the coastal-loving birds can spread east and west, and it’s hoped they’ll eventually be able to link up with existing populations of white-tailed eagles living in Ireland, Scotland, and mainland Europe."
        },
        {
            "text": "Each bird is fitted with a satellite tracker to enable the project team to monitor and track their movements. This data and observations from the field are helping the team to understand how the birds are learning to explore, hunt, and live successfully in southern England."
        },
        {
            "heading": 2,
            "text": "The journey to the Dorset coast"
        },
        {
            "text": "Once released, the eagles explore widely for their first few years, making journeys to all corners of the UK. Some have even crossed the English Channel to spend time in France, the Netherlands, Germany, Denmark and Sweden. However far they explore, the tracking data clearly shows that the birds consistently return to their natal home in the south coast of England."
        },
        {
            "text": "Excitingly, the satellite data has shown that two of the birds released in 2021, known as G801 and G816, have been favouring the habitats of the Lulworth Ranges in Dorset. It’s highly likely that these and other released birds will have been spending time at other nearby MOD sites too."
        },
        {
            "text": "In many ways, it’s unsurprising that these spectacular birds have been gravitating towards parts of the Defence estate. The unique history of our military training areas means they still support large areas of wildlife-rich habitat, which haven’t been affected by intensive agricultural practices or urbanisation to the same extent as the wider countryside."
        },
        {
            "heading": 2,
            "text": "Finding a haven in Lulworth Ranges"
        },
        {
            "text": "G801 and G8116 will no doubt have been attracted to the diverse habitats of Lulworth Ranges on Dorset’s Jurassic coast. Part of the site was established as the very first British tank firing range in 1917, and the ranges now cover 2,830 hectares, over 75% of which is designated as part of three separate Sites of Special Scientific Interest (SSSI)."
        },
        {
            "text": "The ranges are one of the most diverse wildlife sites on the Defence estate, encompassing part of the Dorset heathlands and the Purbeck Hills. The site supports large areas of open heathland, chalk grassland on very steep slopes, pockets of ancient woodland, high sea cliffs and many other habitats. Marsh clubmoss, nightjar, sand lizard, smooth snake, Lulworth skipper butterfly, southern damselfly, dormice, greater horseshoe bats and peregrine falcon are just a few of the rare species associated with these habitats across the ranges."
        },
        {
            "text": "The site will provide a range of roosting and foraging opportunities for the enormous birds, with ample foraging areas for fish, the eagles’ preferred prey, as well as other food. Discussions are underway to find out more about why the eagles are attracted to the site, but clearly regular tank firing is not putting them off!"
        },
        {
            "heading": 2,
            "text": "Ensuring the project’s continued success"
        },
        {
            "text": "We’re looking forward to working with the Roy Dennis Wildlife Foundation and Forestry England to track the progress of the white-tailed eagles in Dorset and beyond. It may even be possible that Lulworth Ranges or another of our sites becomes a breeding ground for the birds, which would be an exciting addition to the wealth of biodiversity on the MOD estate."
        },
        {
            "text": "If you’re a wildlife enthusiast, we’d encourage a walk along the Dorset Coast Path, which runs through Lulworth Ranges, for an opportunity to spot a white-tailed eagle. There are also several circular walks within the ranges, but please be sure to check firing times in advance and stick to permitted routes when accessing MOD land."
        },
        {
            "text": "If you are lucky enough to have a close encounter with an eagle, or any other wildlife, please give the animal plenty of space and avoid scaring it from its position, which can cause the birds to expend vital energy and interrupt their ability to feed."
        }
    ]
}