{
    "url": "https://mhclgmedia.blog.gov.uk/2025/08/29/court-of-appeal-confirms-key-leaseholder-protections-under-building-safety-act/",
    "title": "Court of Appeal confirms key leaseholder protections under Building Safety Act ",
    "authors": [
        "mhclgpress"
    ],
    "categories": [
        "Building safety"
    ],
    "pub_date": "2025-08-29T16:40:05+01:00",
    "content": [
        {
            "text": "Two significant judgments from the Court of Appeal have confirmed that key provisions of the Building Safety Act 2022 (the Act) apply retrospectively. This means that leaseholders are protected from having to pay to fix safety issues in their building, even if the costs were incurred before the law came into force.   In the first case, Adriatic Land 5 Ltd v Long Leaseholders at Hippersley Point, the Court confirmed that Schedule 8 to the Act, which prevents landlords from passing on historical building safety costs to leaseholders, covers costs incurred before the legislation was introduced. The Court also ruled that these protections are compatible with human rights law, striking a fair balance between landlord’s interests and the wider public interest in making homes safe."
        },
        {
            "text": " In the second case, Get Living Plc v Triathlon Homes LLP, the Court confirmed that Remediation Contribution Orders (RCOs) can be used to recover costs incurred before the Act came into force. RCOs are a legal remedy introduced by the Act which can be used to secure funds towards essential remediation work. These powers allow leaseholders and others to ask the Tribunal to order developers, landlords or associated companies to contribute towards the costs of fixing historical building safety issues. The judgment confirms that public funds should only be used as a last resort.  While further appeals to the Supreme Court are possible, the Court of Appeal’s decisions provide important legal clarity on the scope and application of the Building Safety Act 2022. "
        },
        {
            "text": "Media coverage and legal analysis "
        },
        {
            "text": "The judgments prompted national and trade press coverage, as well as detailed analysis in legal publications.  4 Pump Court, a barrister’s chambers, described the Triathlon case as “a pivotal moment in the interpretation of the Building Safety Act,” noting that the Court “firmly rejected the argument that remediation contribution orders could not apply to costs incurred before the legislation came into force.” The article also highlighted that the ruling “provides welcome clarity for leaseholders and housing associations seeking to recover historic remediation costs.”  Law firm CMS wrote that the decisions “provide much-needed clarity on the scope of leaseholder protections and the operation of remediation contribution orders,” and the Court’s reasoning “will be welcomed by leaseholders and housing campaigners alike.” The article also noted that the rulings “reinforce the government’s intention that the Building Safety Act should have real teeth.”  Housing Today reported the rulings “backed leaseholders and government in key cases on Building Safety Act retrospectivity.” The piece also observed that the judgments “represent a significant endorsement of the government’s approach to building safety reform.” "
        },
        {
            "text": "BBC News also covered the rulings, noting the potential for these decisions to have far reaching implications for building owners, developers and leaseholders. The article included legal commentary, highlighting that while retrospective legislation is unusual, it is essential to ensure leaseholder protection and to hold those responsible for defects to account. "
        }
    ]
}