{
    "url": "https://defrafarming.blog.gov.uk/2025/08/29/landscape-recovery-first-projects-move-into-delivery-phase/",
    "title": "Landscape Recovery: first projects move into delivery phase ",
    "authors": [
        "Rebecca Kenner"
    ],
    "categories": [
        "Payments to restore landscapes and ecosystems"
    ],
    "pub_date": "2025-08-29T10:19:23+01:00",
    "content": [
        {
            "text": "Following two years of development work, two pioneering projects have now secured their funding and are beginning long-term delivery on the ground. "
        },
        {
            "text": "Together, they represent over £55 million of investment. Landscape Recovery funding will sit alongside private investment in an innovative ‘blended finance’ model, combining public and private money over the next 20–30 years. "
        },
        {
            "text": "In this post, I’ll share an overview.  "
        },
        {
            "heading": 2,
            "text": "Background"
        },
        {
            "text": "Landscape Recovery is one of our environmental land management schemes. It supports large-scale, long-term projects that restore nature, improve biodiversity and deliver environmental benefits across whole landscapes in England. "
        },
        {
            "text": "Projects bring together farmers, landowners, environmental organisations and local communities to create plans tailored to their local area.  "
        },
        {
            "text": "By combining government funding with private investment, projects can be more ambitious, spread risk, and open new income streams for farmers and landowners through things like Biodiversity Net Gain (BNG) units and carbon credits. "
        },
        {
            "text": "This approach is still relatively new, but it shows how nature recovery can become an economically viable and sustainable use of land. "
        },
        {
            "text": "Projects are focused on ambitious environmental goals while at the same time aiming to strengthen rural communities and support local action to make space for nature alongside food production. "
        },
        {
            "text": "One particular outcome of these projects is the benefits they will bring to our waterways.  "
        },
        {
            "text": "The projects in round 1 expect to restore over 600 kilometres of rivers, alongside species recovery of more than 250 species. This includes fish, amphibians such as toads and newts, waterfowl, as well as a controlled reintroduction of beavers.  "
        },
        {
            "text": "These projects aim to restore bodies of water, rivers and floodplains to a more natural state. They will also seek to reduce nutrient pollution, benefit aquatic species, and improve flood mitigation and resilience to climate change.  "
        },
        {
            "heading": 2,
            "text": "From development to implementation"
        },
        {
            "text": "In 2022, 22 projects were chosen for the first round of Landscape Recovery. Each received funding from government to begin the Project Development Phase (PDP). This support helped them design detailed, long-term plans for restoring nature across large areas of land. "
        },
        {
            "text": "During this phase, projects worked closely with farmers, landowners, communities and environmental groups. Together they developed proposals to support wildlife, improve water quality, build flood resilience and sustain local economies alongside food production. "
        },
        {
            "text": "At the end of this phase, projects may be offered funding to move into the next stage, known as the Project Implementation Phase. To move into this phase, each project must pass through a rigorous assurance process. Experts review the proposals to make sure that public funding is well spent and that projects will contribute to environmental goals. "
        },
        {
            "text": "The first 2 projects have now completed the necessary checks, signed their agreements and are ready to start work on the ground."
        },
        {
            "heading": 2,
            "text": "Boothby Wildland: the first to be offered an implementation agreement"
        },
        {
            "text": "Boothby Wildland is the first project to move into the Project Implementation Phase. "
        },
        {
            "text": "Boothby Wildland is a large-scale nature recovery project near Grantham in Lincolnshire. It spans roughly 620 hectares of former Grade 3 arable farmland. "
        },
        {
            "text": "The land was bought in 2021 by Nattergal, a nature restoration company. The project aims to transform the site through natural colonisation, creating a rich and dynamic mix of habitats, including wetland, woodland, scrub and grassland. These areas will provide habitats for many notable species from small invertebrates and butterflies to bats. "
        },
        {
            "text": "In the early years, the focus was on preparation. This included detailed ecological and hydrological surveys to create environmental baselines, as well as earthworks to reshape the land and help natural watercourses.  "
        },
        {
            "text": "Rivers and streams that had previously been straightened or drained are now being returned to more natural forms, with meanders and seasonal pools supporting wetland species. At least 3 kilometres of streams and the River Glen will be restored and encouraged to follow a more natural course after centuries of drainage, dredging and canalisation. "
        },
        {
            "text": "By restoring habitats, including those needed by beavers, the project will bring back local wildlife and improve water quality, a government priority. Slowing the river and allowing it to flood naturally will reduce agricultural runoff and pollutants entering waterways. "
        },
        {
            "text": "The site also hosts corporate away days, guided walks, volunteering sessions and educational visits. A digital platform, WildMap, tracks wildlife sightings and ecological change. "
        },
        {
            "text": "The project is generating income by selling ecosystem services such as Biodiversity Net Gain (BNG) units and carbon credits, alongside wildland experiences. In time, it will also produce meat sustainably. This shows how environmental recovery can enable the long-term, sustainable use of land. "
        },
        {
            "text": "As one of the first Landscape Recovery projects to move into delivery, Boothby is helping to shape the future of land use in England. The site now employs more people than it did during conventional farming. "
        },
        {
            "text": "Pete Holland, local volunteer at Boothby Wildland, says: “For me, Boothby symbolises the opportunity to invest in nature to set up a different future for our society. Being a volunteer and having the chance to play a small part in contributing to restoring nature to how it should be has been extremely powerful and rewarding for my heart and soul. One day I’ll walk the site with my children and be able to say, ‘I helped create this’.” "
        },
        {
            "text": "Learn more about the Boothby project. "
        },
        {
            "heading": 2,
            "text": "Upper Duddon: the second to be offered an implementation agreement"
        },
        {
            "text": "Led by the University of Leeds, the Upper Duddon project brings together farmers, environmental organisations and the local community to manage 2,800 hectares of uplands in West Cumbria. "
        },
        {
            "text": "The project works with 10 land managers, 6 of them tenant farmers, showing the strength of collaborative working. It recognises the important role of upland fell farmers and supports them in restoring habitats and enhancing nature across the landscape.   "
        },
        {
            "text": "Tucked away in the heart of the Lake District National Park, the Duddon Valley is rich in local history and culture. One of the quietest and most wooded valleys in the area, it’s home to extensive ancient broadleaf woodland, making it a valuable haven for wildlife. "
        },
        {
            "text": "The project will restore a mosaic of meadows, heathland, wood pasture, scrub, woodland, temperate rainforest and blanket bog. Alongside restoration of habitats, the project will also help the recovery of local wildlife such as tree pipit, pine marten and water vole. "
        },
        {
            "text": "This project is set to deliver a range of environmental benefits including a reduction in downstream flood risk.  Restoration work, which includes re-naturalisation, will improve water quality in parts of the River Duddon and its tributaries. "
        },
        {
            "text": "A volunteering programme will provide opportunities for the local community and visitors to contribute to nature recovery. A new community wildflower and tree nursery will grow the flowers and trees needed to help habitats recover. "
        },
        {
            "text": "Careful monitoring will track the recovery of habitats and species as the project progresses.  "
        },
        {
            "text": "This 20-year project will help ensure a vibrant future for small farms and support the local rural economy by creating new jobs. We hope that the partnerships formed, and the progress made through this funding, will have a lasting impact for generations. "
        },
        {
            "text": "Learn more about the Upper Duddon project. "
        },
        {
            "heading": 2,
            "text": "What next for Landscape Recovery"
        },
        {
            "text": "The government reaffirmed its commitment to Landscape Recovery in the recent Spending Review, recognising the role of farmers, land managers and others in restoring habitats, improving water quality, and reducing agricultural pollution in our rivers and streams. "
        },
        {
            "text": "The Landscape Recovery team is currently working to assess the deliverables submitted by other Round 1 projects, guiding them through the assurance process.  "
        },
        {
            "text": "The second round of pilot projects that we onboarded onto the scheme in 2023 are showing significant progress through their development phases. Some have also begun to submit their exciting plans for assurance, and we look forward to working with these projects in the future. "
        },
        {
            "text": "Not all pilot projects will pass this process. Some may not pass the assurance stage, and as a result won’t be offered a Project Implementation Phase agreement. Others may decide to withdraw earlier or decide their ambitions would be better delivered through other sources of funding. "
        },
        {
            "text": "As a result, we have already seen two projects leave the scheme. These projects will go through an offboarding process and, where possible, be signposted to other sources of funding so they can continue to build on the progress made during development. "
        },
        {
            "text": "The government funding provided during the development phase helps projects form strong local partnerships, support rural economies and carry out technical work like environmental surveys. These activities lay solid foundations for future projects and can help attract private or alternative investment. "
        },
        {
            "text": "We are excited to see more Project Implementation Phase agreements signed soon, and the groundbreaking work these projects are going to accomplish because of the unique opportunity. "
        },
        {
            "text": "Subscribe to the Farming blog for the latest updates. "
        }
    ]
}