{
    "url": "https://environmentagency.blog.gov.uk/2025/08/29/world-water-week-2025/",
    "title": "World Water Week 2025",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Climate change",
        "Environment Agency",
        "Flood",
        "Water"
    ],
    "pub_date": "2025-08-29T11:43:05+00:00",
    "content": [
        {
            "text": "From left, Rob Bradburne and John Leyland  at the UK Pavilion stand before leading their session on Collaboration in Action. "
        },
        {
            "text": "This week marked World Water Week, hosted by the Stockholm International Water Institute (SIWI) in Sweden."
        },
        {
            "text": "Our very own Executive Director of Environment & Business, John Leyland and Chief Scientist, Rob Bradburne, were invited to take to the global stage, sharing their expertise and knowledge on all things water."
        },
        {
            "text": "Joining a diverse community of practitioners, policymakers, researchers, private sector leaders, and civil society representatives, John and Rob attended and spoke at several sessions designed to tackle pressing challenges at the intersection of water, climate, development, and biodiversity."
        },
        {
            "text": "Rob takes to the stage, introducing a session on the health of rivers around the world and how adopting nature-based solutions can help improve them"
        },
        {
            "text": "The theme for 2025, Water for Climate Action, highlights the critical role of water in addressing climate, environmental, and biodiversity crises - focused on solutions that support mitigation, adaptation, and resilience, with a strong emphasis on climate justice, equity, and the needs of vulnerable communities. "
        },
        {
            "text": "John spoke at the UK Embassy on how the Environment Agency is embedding climate adaptation into national water infrastructure planning. "
        },
        {
            "text": "He highlighted the use of flexible ‘adaptation pathways’ to manage floods and droughts, alongside nature-based solutions that deliver multiple benefits. "
        },
        {
            "text": "Alongside Rob, he also led a session with Northen Ireland’s utility regulators exploring how strategic partnerships in regulation help tackle shared challenges in the water sector, using case studies to show how collaboration shapes effective strategies. "
        },
        {
            "text": "Rob spoke at two sessions – Changing Tides and Flood Resilience – reflecting on the UK’s history of floods and droughts, including the current drought. He emphasised how science, data, and collaborative frameworks, including the Water Framework Directive, support practical responses and build long-term resilience for communities, infrastructure, and the environment. "
        },
        {
            "text": "John participating in the Water for Countries session, addressing the question of embedding climate adaptation into national water infrastructure planning"
        },
        {
            "text": "The trip has been a valuable opportunity for John and Rob to represent the Environment Agency on a global platform, showcasing our work and leadership in water management and climate resilience. "
        },
        {
            "text": "It has allowed the pair to engage with international counterparts to learn from global best practices and innovative approaches to water governance and strengthen networks and partnerships that support collaborative action on climate and water challenges. "
        },
        {
            "text": "As John and Rob return home to a very dry country in drought, they bring with them new insights to inform and enhance the Environment Agency’s water strategies and operations in England."
        },
        {
            "text": "Nature-based solutions: Environment Agency position statement"
        },
        {
            "text": "Our latest drought information "
        }
    ]
}