{
    "url": "https://actuaries.blog.gov.uk/2023/08/03/a-rewarding-experience/",
    "title": "A rewarding experience",
    "authors": [
        "Georgina Bedenham - Actuary"
    ],
    "categories": [
        "Actuary",
        "Analysis",
        "Climate change",
        "Risk management"
    ],
    "pub_date": "2023-08-03T10:35:41+01:00",
    "content": [
        {
            "text": "I thought my year-long secondment to the Centre for Disaster Protection would teach me a lot about the world of international development and disaster risk financing. However, it has also taught me a lot about myself."
        },
        {
            "heading": 2,
            "text": "Disaster risk financing"
        },
        {
            "text": "The Centre for Disaster Protection’s mission is to change the way the world plans and pays for disasters by driving more effective disaster risk financing."
        },
        {
            "text": "Extreme events such as drought, flood and epidemics can have a huge impact in terms of loss of life, livelihoods and destruction to vital infrastructure such as hospitals and schools. Unfortunately, due to climate change, these extreme events are becoming more intense and more frequent."
        },
        {
            "text": "Disaster risk financing, or DRF, aims to reduce the impact on those living in poverty who are often the most vulnerable when a crisis hits. Traditionally the approach to responding to disasters has been reactive, for example through humanitarian appeals, and this can mean any funding is slow and often insufficient."
        },
        {
            "text": "DRF is about setting up financial instruments before disasters happen so funding can be released at the right time and targets those most in need. For example, through budgetary mechanisms such as reserve funds, or risk transfer instruments such as parametric insurance or contingent credit."
        },
        {
            "heading": 2,
            "text": "Understanding the context"
        },
        {
            "text": "One of the first lessons I learnt on my secondment was that context is key in DRF. As an actuary I was keen to use my theoretical knowledge of financing mechanisms and risk to give advice on how DRF proposals could be improved."
        },
        {
            "text": "While this can be helpful, understanding the context is vital to any decision making in DRF because there can be conflicting priorities and needs, and certain financing mechanisms may not be readily available."
        },
        {
            "text": "I found it incredibly rewarding to see the impact of my work and to bring to life the importance of context. This was especially true when I had the opportunity to support the development of a country’s disaster risk finance strategy. I worked alongside the government and a donor-funded programme to develop the financing instruments part of the strategy."
        },
        {
            "text": "I developed a step-by-step framework for the government to follow to work out the right selection of financial instruments for their needs and priorities."
        },
        {
            "text": "This required a combination of cost benefit analysis of the different instruments, as well as looking at the wider considerations, such as the availability, mobilisation speed and reliability of the instruments  available."
        },
        {
            "heading": 2,
            "text": "New ways of working"
        },
        {
            "text": "For me, DRF is like building a house – you can’t build the house on your own!"
        },
        {
            "text": "Firstly, you need a multi-disciplinary team of experts to come together to make it work. Alongside risk advisers at the Centre there are researchers, humanitarian specialists, policy experts, evaluators and communicators."
        },
        {
            "text": "Secondly and crucially, you need local engagement and support – otherwise you are building something that doesn’t reflect the situation or specific needs in that country."
        },
        {
            "text": "I learned quickly that I don’t need to know all the answers. Before joining the Centre, I thought “I know very little about this area of work, how am I going to be any use to the team?”. However, my secondment has made me more creative and has shown me that the actuarial skillset can be used in many different ways."
        },
        {
            "heading": 2,
            "text": "Using my skills to help others"
        },
        {
            "text": "One of the big takeaways for me was how actuaries can be helpful in areas that may not have traditionally been viewed as actuarial. For a start, actuaries understand risk and ways to manage risk through financial mechanisms."
        },
        {
            "text": "But we can also bring other skills that we might not always see as being big selling points such as:"
        },
        {
            "text": "Therefore, it’s not always what you know but how your skills can be applied in different contexts that can be essential."
        },
        {
            "text": "Find out more about Georgi’s secondment, the work of the Centre and GAD in her interview in The Actuary magazine, along with their first ever podcast."
        },
        {
            "text": "Disclaimer"
        },
        {
            "text": "The opinions in this blog post are not intended to provide specific advice. For our full disclaimer, please see the About this blog page."
        }
    ]
}