{
    "url": "https://naturalengland.blog.gov.uk/2023/08/03/farming-for-nature-recovery/",
    "title": "Farming for Nature Recovery",
    "authors": [
        "Natural England"
    ],
    "categories": [
        "Biodiversity",
        "Environment Act",
        "Farming",
        "Landscapes",
        "Landscapes and access",
        "Natural England",
        "Nature Recovery Network",
        "Protected sites and species",
        "Science and evidence",
        "Site of Special Scientific Interest",
        "Species recovery",
        "Wildlife",
        "wildlife and farming"
    ],
    "pub_date": "2023-08-03T15:43:24+01:00",
    "content": [
        {
            "text": "Across the country, Natural England is working closely with farmers and landowners to deliver nature recovery at a landscape-scale - restoring and enhancing England’s wildlife-rich places. A fine example of this is within our Sussex and Kent team, where we have some amazing, real-world examples of where food production, nature recovery and sustainable business models are working hand in hand with the farmers, as well as other partners."
        },
        {
            "text": "One area in particular, is Marden in Kent. Marden sits in the Low Weald, in a highly productive landscape. It has no statutory designation but is nestled between two rivers, the Beult and the Teise. In the heart of the area is a small Site of Special Scientific Interest (SSSI), Marden Meadow. It was designated for being one of the best examples of remaining lowland meadow, a meadow system filled with green winged orchids."
        },
        {
            "text": "We have been working for a while with a small proportion of landowners in the area who have agri-environment schemes. Five years ago, when we came to review these schemes, we experienced a sudden swell of momentum – the landowners we were working with wanted to increase space for nature on their land. We also had new landowners coming to us to talk about what could be achieved. From this momentum, we devised three core objectives to build into the schemes that would best reflect the area – Water Quality improvement for the two rivers, recovering declining farmland birds and expanding out the Lowland Meadow Priority Habitat onto surrounding farmland through green hay spreading from the SSSI. This would be paid for through agri-environment support."
        },
        {
            "text": "Fast forward five years of collaboration between the farmers and Natural England, we now have a farm cluster - over 30 Countryside Stewardship schemes clustered together, and a Marden Wildlife Group involving the farmers that has brought the community together too. We discovered that, what works best for the area, is Natural England supporting through an integrated, on-the-ground-advisor who delivers the Catchment Sensitive Farming programme and who can develop Higher Tier agri-environment schemes to achieve the greatest outcomes. This is combined with farmers providing regular feedback and advice to each other each other about best practices and how to develop a sustainable business model using agri-environment support."
        },
        {
            "text": "The results from this collaboration speak for themselves. We have recovered nature in the less productive areas, developed key sites next to the rivers as protection buffers, created wildlife corridors through - and along - intensive arable fields and one of the factors I am most pleased about is that we have integrated nature and soil recovery into the arable system. We have over 200 hectares of land that is in a two-year legume rich fallow system: For two years it is planted with pollen and nectar rich legumes that make the fields alive with insects whilst also restoring the soils with varying rooting depths and nitrogen fixing legumes which can also be cut to control black grass. After two years, the land is then changed back to crop production for food, and we rotate the legume fallow plot to different fields to restore those – and thus the cycle continues."
        },
        {
            "text": "The additional ‘cherry on the cake’ is the connection the landowners have made with the community. We are blessed to have a fantastic local Data Recorder who has stepped up to help drive a Citizen Science approach to understanding what we have got on the land, supported by agri-environment schemes. All of this is celebrated on the Marden Wildlife Facebook page, which now has approaching 800 members. Members of the community have helped spot the local turtle doves we are focusing in on through agri-environment, and spotting where they are as well as reporting a plethora of other rare species data."
        },
        {
            "text": "We have worked with partners like Kent Wildlife Trust, the RSPB, BTO, Southeast Rivers Trust and Southeast and Southern Water as part of the wider efforts of our objectives. All have yielded positive results for the area."
        },
        {
            "text": "From our wildlife’s perspective, we now have a landscape scale project, with well-connected wildlife corridors of pollen and nectar in spring/summer, winter bird crops through the colder months. We have essential nesting habitats, priority habitat such as Lowland Meadows, buffer strips protecting our watercourses and over 200 hectares on a rotation system between crop production and nature recovery areas, some plots on a whole field basis, which is delivering essential wildlife habitats"
        },
        {
            "text": "We have farmers that have a guaranteed steady income over the course of five to ten years, which allows them to build their business whilst enjoying a greater wildlife-rich farm. Natural England support on the ground has helped steer the project over time to guide landowners on what needs to be done and develop these trusted relationships. And now we have the community proud of their local environment and the work being achieved for nature’s recovery."
        },
        {
            "text": "One of our local farmers, Peter Hall, who gave a speech at the recent Natural England Parliamentary Reception on 10 July stated:"
        },
        {
            "text": "“In our minds, soil, air, water and nature recovery can and must go hand in hand with modern food production. Our experience is that these are mutually beneficial rather than mutually exclusive and are fundamentally reliant upon each other for rural economic development and the delivery of the myriad other benefits to our communities.” "
        },
        {
            "text": "It is evident that collaborative work, such as the projects taking place in the Marden area, is key to nature’s recovery. It clearly demonstrates that food production is fully compatible with thriving nature and restoring key habitats. If we are to meet our targets of halting species decline by 2030, alongside boosting rural economic development, we need to see more collaboration on the ground and more communities involved."
        },
        {
            "text": "To learn more about Environmental Stewardship and other agri-environment schemes, see the following link: https://publications.naturalengland.org.uk/category/35001"
        },
        {
            "text": "---"
        },
        {
            "heading": 5,
            "text": "By Ben Thompson"
        },
        {
            "heading": 5,
            "text": "Team Leader – Natural England"
        },
        {
            "heading": 5,
            "text": "Greener Farming and Fisheries (Kent and Sussex)"
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}