{
    "url": "https://ipo.blog.gov.uk/2023/08/03/knocking-the-fakes-out-of-football/",
    "title": "Knocking the fakes out of football",
    "authors": [
        "Imogen Percival"
    ],
    "categories": [
        "Enforcement"
    ],
    "pub_date": "2023-08-03T11:30:03+01:00",
    "content": [
        {
            "text": "There’s no place for counterfeit kits in the World Cup, or any area of football in fact. From grassroots to the Premier League, fakes prevent clubs and everyone who works at them, from reaping the rewards of their intellectual property rights and receiving funds they make from merchandise."
        },
        {
            "text": "For the 2022 FIFA World Cup, the IPO ran an educational campaign to raise awareness of the harm counterfeits pose to the football community, consumers and the wider UK economy. Last year we launched our Counter-Infringement Strategy, which aims to combat IP crime by enhancing intelligence, developing valuable partnerships and producing impactful campaigns, of which this campaign delivered."
        },
        {
            "text": "In partnership with marketing agency Hitch, based in the Wirral, we developed an insight-driven campaign to educate men aged 18-34 about these harms and encourage them to avoid fake kits during the World Cup. We identified the target audience by examining consumer opinion and online social commentary around counterfeit football goods. The campaign was also aligned with the seizure of counterfeit football shirts by the Police Intellectual Property Crime Unit (PIPCU)."
        },
        {
            "text": "Foul play worth half a million"
        },
        {
            "text": "In a mammoth effort from PIPCU, officers seized over £500,000 worth of counterfeit football shirts from across the UK in the months leading up to the World Cup. This multi-agency operation, co-ordinated by the IPO saw law enforcement activity to tackle criminal activity head on."
        },
        {
            "text": "Six people were arrested for the distribution and sale of counterfeit goods and £12,000 was seized. At East Midlands Airport, where we have dedicated Border Force staff to investigate IP infringement, over 18,000 shirts were seized."
        },
        {
            "text": "Supported by colleagues from North West PIPCU, officers also searched premises in Leeds and Sheffield, seizing a large quantity of counterfeit England shirts and a total of £12,000 cash. Further raids in Bristol and Northampton also led to around £250,000 worth of counterfeit shirts being seized."
        },
        {
            "text": "This national effort was publicised in a number of major news publications across the UK, highlighting the real harm that counterfeits pose to communities. The seizures not only took money out of criminals’ pockets but also helped protect consumers from being scammed by a poor-quality product, which could contain hazardous materials."
        },
        {
            "text": "Covering all angles"
        },
        {
            "text": "The enforcement activity was coupled with an innovative educational campaign during the FIFA World Cup, named ‘Wear Real’. We were delighted to be nominated for a Prolific North Award for the campaign recently."
        },
        {
            "text": "Using a multi-platform approach, we worked with Hitch Marketing to promote a graphics-based campaign across social media platforms. This direction was chosen based on desk research, digital tactical analysis and a survey that looked at the opinions and behaviours of primarily young men."
        },
        {
            "text": "Although there are many reasons why counterfeits are harmful, we wanted to ensure our message would resonate well with the target audience. The research and subsequent results from the campaign showed that the most effective messages were:"
        },
        {
            "text": "Our counterfeit goods research published last year explains more about message effectiveness."
        },
        {
            "text": "A fake Harry Kane"
        },
        {
            "text": "Paul Machin, creative director and football presenter behind Maych TV, worked with us to promote the campaign on his YouTube channel. In the video, Paul spoke to Harry Kane, well a lookalike Harry Kane, about the difference between fake and real World Cup kits."
        },
        {
            "text": "Unboxing the kits, Paul reveals the dodgy logo, dirty material and poor-quality stitching of the fake shirt. This video helped bring the subject to life and engaged the audience in an innovative way."
        },
        {
            "text": "Bringing it home"
        },
        {
            "text": "By the time we came to the World Cup final between Argentina and France on 18 December, the campaign had rounded up. The social media messaging shared across Facebook, Instagram, Twitter, Snapchat and TikTok reached around 2.5 million people and had 20K clicks."
        },
        {
            "text": "The Harry Kane lookalike video clips circulated on social media generated nearly 3 million impressions and around 36K clicks through to the full video."
        },
        {
            "text": "We also gained key insights on the sentiment surrounding counterfeit football shirts from the YouTube video, including positive comments such as:"
        },
        {
            "text": "“Bought the fake at first, didn’t like the feel of it. The material was so uncomfortable, and the collar was way too wide for some odd reason. Bought the genuine one and don’t regret it one bit. So much better than the fake.”"
        },
        {
            "text": "These insights will enable us to develop our strategy as we continue to run educational campaigns as a part of the IPO’s Counter-Infringement Strategy. We continue to work with our partners including Police, Trading Standards and industry experts to fight IP crime with a multi-pronged approach and ensure the best protection for UK IP rights holders."
        }
    ]
}