{
    "url": "https://marinescience.blog.gov.uk/2023/08/03/making-waves-recent-contributions-of-cefas-fisheries-science-for-the-future-of-fisheries-management-in-the-uk/",
    "title": "Making waves: recent contributions of Cefas fisheries science for the future of fisheries management in the UK",
    "authors": [
        "Bek Trehern",
        "Rui Pedro Vieira",
        "Rebecca Skirrow",
        "Thomas Catchpole"
    ],
    "categories": [
        "biodiversity",
        "Fisheries",
        "Monitoring",
        "Policy",
        "Science",
        "Technology"
    ],
    "pub_date": "2023-08-03T15:40:11+01:00",
    "content": [
        {
            "text": "On Monday 17th July, the UK government’s Department for the Environment, Food and Rural Affairs (Defra) announced further steps to deliver a thriving, sustainable fishing industry and healthy marine environment following the UK’s exit from the European Union (EU). As part of Brexit negotiations, the EU has agreed to transfer 25% of the EU’s fishing rights within UK waters (in terms of value) back to the UK between now and June 2026. As an independent coastal state, the UK controls who may fish in our waters, and on what terms.  "
        },
        {
            "text": "In this recent announcement, the UK set out a range of new approaches and consultations, which draw on science and industry expertise. These are intended to ensure our fish stocks are healthy and sustainable long into the future.  "
        },
        {
            "text": "Cefas is an Arm’s Length Body (ALB) of Defra and is the government’s marine and freshwater science organisation. We provide science, data and advice to help inform the policy and decision making to ensure that our seas, oceans and rivers are healthy and productive, and our seafood is safe and sustainable.  "
        },
        {
            "text": "In this blog, we speak to Cefas scientists and ask them to share their perspectives on how our science has contributed to the evidence base behind some of the recent announcements and upcoming consultations. "
        },
        {
            "text": "Fisheries Management Plans Announcements "
        },
        {
            "text": "Fisheries Management Plans (FMPs) are evidence-based action plans that aim to deliver sustainable fisheries for current and future generations. Developed in collaboration with the fishing sector and other stakeholders and based on the best available science, industry experience, and consultations with key stakeholders, FMPs set out a range of policies that detail how fishing is managed, by stock, fishery, or location. Six FMPs have now been announced for consultation and are the first of the forty-three FMPs proposed in the UK’s Joint Fisheries Statement.  "
        },
        {
            "text": "Dr Rui Vieira, Senior Fisheries Scientist at Cefas, said: "
        },
        {
            "text": "“Supporting Defra on this commitment has been a great opportunity for Cefas to provide evidence-based advice for achieving sustainable fisheries in the UK and healthy fish stocks. Since the launch of the FMP Programme, Cefas colleagues have worked in partnership with Defra and FMP delivery partners in providing the underpinning evidence to meet the requirements set out in Section 6 of the Fisheries Act 2020. This has included gathering available biological and ecological information, identifying evidence gaps in stock assessments, and an understanding of existing management and technical measures to inform the development of FMPs.”  "
        },
        {
            "text": "Consultation on Remote Electronic Monitoring (REM) "
        },
        {
            "text": "Remote Electronic Monitoring (REM) is a data collection tool using cameras, sensors, Global Positioning System (GPS) and artificial intelligence computing onboard commercial fishing vessels. Using this technology, scientists can analyse video footage of commercial catches onboard vessels to provide robust advice on fisheries and their management. In this latest announcement, Defra is hosting a consultation on the expansion of REM, with five priority fisheries shortlisted to support effective monitoring and better data collection, helping to deliver data-led fisheries management plans. "
        },
        {
            "text": "Rebecca Skirrow, Senior Fisheries Scientist at Cefas said: "
        },
        {
            "text": "“Looking to the future, sustainable and well managed fisheries will depend on more effective monitoring and data. Cefas has gained a wealth of experience in using REM over the last decade in projects ranging from industry self-sampling validation to industry dependent surveys, gear selectivity trials and full catch composition data collection in UK waters from the Celtic Sea to the North Sea. These experiences, along with those from other agencies, including the Marine Management Organisation (MMO) and Natural England have been collated by Defra to provide a strong basis of information upon which the consultation has been built. This has contributed to the identification of the priority fisheries, the potential data needs in each fishery, and the real-world feasibility of implementing REM on the scale suggested by Defra. As a result, our evidence has helped develop a realistic and achievable proposal, resulting in a suggested stepwise approach with a focus on collaboration along the way. Thinking ahead to after the consultation, the work will really begin to make the proposals a reality. The experiences of those that have fed into the consultation will continue to be integral to seeing this come to fruition. Cefas has learnt a lot about how scientific data needs to be collected, classified using computer vision artificial intelligence and analysed so that it can be used in fisheries management and stock assessments. These experiences will be the foundations of scientific data usage in the priority fisheries, in addition to drawing on experiences of others including the MMO and the fishing industry to ensure the approach is tailored to each fishery and workable in the real-world context.” "
        },
        {
            "text": "Consultation on discards reform "
        },
        {
            "text": "In 2019, the Landing Obligation (LO), a ban on returning unwanted catches into the sea, was fully implemented across the EU. A review of data conducted by Cefas reported that there was no detectable reduction in discard rates for English vessels following the implementation of the LO.  For some Total Allowable Catches (TACs), unwanted catches of fish may be discarded and not recorded which may lead to the total catch (landings and discards) exceeding the UK TAC share. As part of the bycatch objective, there is a need to record and account for all catches (catch accounting) to ensure that these quotas are not exceeded. Cefas research identified TACs which were at risk of exceeding the UK TAC share by UK vessels when accounting for discards. From this work, Cefas were able to determine which TACs could be prioritised for enhancements in catch accounting to mitigate the risk of fishing beyond agreed levels. In a move towards longer term sustainable fisheries, to increase the avoidance and reduction of unwanted catches, Defra is consulting on different approaches to the management of discards. "
        },
        {
            "text": "Dr Thomas Catchpole, Principal Fisheries Science Advisor at Cefas said:  "
        },
        {
            "text": "“The unintended capture and discarding of unwanted fish is a threat to sustainable fishing. The EU Landing Obligation was meant to minimise discards, but Cefas research showed it had no detectable effect on UK discard patterns and identified that catches of some TACs exceeded UK quotas when discards were accounted for. Working closely with Defra and the MMO, Cefas developed new evidence-based approaches to better account for all catches and incentivise the avoidance of unwanted fish, which now form the basis of a consultation on a new UK discards policy. The evidence-based approach makes use of estimates of discard rates derived from observer programmes and other monitoring, to ensure all catches are being counted against quotas. From this evidence, Cefas, Defra and the MMO have developed two possible methods to account for catches. Over time it could incentivise the avoidance of discarding, as discards would be accounted for and would be deducted from the quota to account for the full catch. The consultation highlights the importance of the Cefas observer programme, collaboration with the fishing industry and the potential of innovative approaches, including REM, which are being developed by Cefas”. "
        }
    ]
}