{
    "url": "https://insidedio.blog.gov.uk/2023/08/03/supporting-biodiversity-on-the-mod-estate-in-scotland/",
    "title": "Supporting biodiversity on the MOD estate in Scotland",
    "authors": [
        "Lottie Birch"
    ],
    "categories": [
        "Conservation",
        "Defence Training Estate (DTE)",
        "Environment and Ecology"
    ],
    "pub_date": "2023-08-03T14:19:21+00:00",
    "content": [
        {
            "text": "The Small Blue butterfly is the UK’s smallest resident butterfly and is declining in most areas [Copyright Alan Richardson]The MOD’s estate is home to some of the most unique and nature-rich landscapes in the UK, and the regions of Scotland and Northern Ireland I oversee as an ecologist for DIO are no exception."
        },
        {
            "text": "My role is an incredibly varied one and involves addressing a multitude of demands on our landscapes linked to wildlife, carbon emissions, air and water pollution and many more aspects of the natural environment – all in balance with the primary use of the land, which is military training. Providing expert advice to help facilitate sustainable development is a key part of this effort, along with managing conservation projects across our estate."
        },
        {
            "text": "A great example of one such project is the work we’ve carried out with DIO’s industry partner, Landmarc, to restore habitats for the scarce and elusive Small Blue butterfly at Barry Buddon Training Area on the Angus coast in Scotland."
        },
        {
            "heading": 2,
            "text": "About Barry Buddon Training Area"
        },
        {
            "text": "Barry Buddon is an active military training area, comprising 930 hectares of coastal plain on the Tay Estuary between Carnoustie and Monifieth. It’s primarily used for small arms infantry training and features several firing ranges."
        },
        {
            "text": "Perhaps surprisingly given its military use, the site is a haven for wildlife, with a rich sand dune ecology supporting a host of birds, reptiles, amphibians and invertebrates. Much of the training area is a designated Site of Special Scientific Interest and a Special Area of Conservation, as well as a Special Protection Area for its bird populations."
        },
        {
            "text": "As with many of the UK’s military training areas, it is partly the absence of development and intensive agriculture at Barry Buddon over many decades that has helped this array of wildlife to flourish."
        },
        {
            "heading": 2,
            "text": "The project’s origins"
        },
        {
            "text": "Our work to provide a further boost to biodiversity at Barry Buddon by restoring habitats for the Small Blue butterfly began in 2019. At the time, my predecessor John Black was working as DIO’s ecologist for Scotland and Northern Ireland, and John played a key role in the project’s initial stages."
        },
        {
            "text": "One of the Small Blue butterflies spotted at Barry Buddon Training Area this summer [Crown Copyright / MOD 2023]A team at Carnoustie golf course, located not far from the training area, was carrying out work to attract the butterfly by planting its sole foodplant, the Kidney Vetch. This provided a great opportunity to extend a feeding ‘corridor’ through Barry Buddon to boost the butterfly’s populations within the site and across the surrounding local region."
        },
        {
            "text": "Over the last few years, the DIO ecology team has supported Landmarc colleagues in establishing Kidney Vetch along road and track verges to restore connectivity between breeding colonies of the Small Blue. Since 2022, we’ve focused on continuing the removal of thatch and moss from road verges to provide the growing conditions that Kidney Vetch requires, while monitoring the distribution of the Small Blue across the feeding corridors created."
        },
        {
            "text": "Throughout the project, we’ve been supported by the Butterfly Conservation charity, which has helped monitor the Small Blue population on the training area, along with sharing advice and information on the conservation of the butterfly and its habitats."
        },
        {
            "heading": 2,
            "text": "Celebrating success this summer"
        },
        {
            "text": "We recently welcomed a representative from Species on the Edge, a conservation programme focused on reversing the decline of vulnerable coastal species in Scotland, to Barry Buddon to survey the project’s progress. During the visit, we were thrilled to spot a pair of Small Blue butterflies in full flight on the training area!"
        },
        {
            "text": "Seeing the species we are trying to conserve is a real treat and a truly rewarding part of the work we do in the DIO ecology team. The presence of the Small Blue – a priority species on the Scottish Biodiversity List – at Barry Buddon is a testament to the hard work that’s been carried out over the last few years."
        },
        {
            "text": "The sighting of the Small Blue butterfly at Barry Buddon follows years of conservation efforts to restore habitats for the species at the site [Crown Copyright / MOD 2023]Our work at Barry Buddon is contributing to a wider biodiversity initiative in the Angus region to restore populations of the Small Blue, which have been in decline in the UK since the 1950s. With continued careful management, we will ensure that the species can continue to thrive on the training area and throughout the region."
        },
        {
            "text": "Keep an eye on our blog for future updates about the work DIO ecologists are carrying out across the Defence estate to protect the natural environment and support the delivery of the MOD’s biodiversity commitments."
        }
    ]
}