{
    "url": "https://environmentagency.blog.gov.uk/2023/08/03/water-body-data-update-may-2023/",
    "title": "Water body data update May 2023",
    "authors": [
        "Environment Agency"
    ],
    "categories": [
        "Environment Agency"
    ],
    "pub_date": "2023-08-03T09:49:09+00:00",
    "content": [
        {
            "text": "Understanding the environment is one of the Environment Agency’s main areas of expertise. Taking samples and analysing them in the lab provides the unequivocal evidence we need to identify where the problems are and where we need to secure investment to make improvements."
        },
        {
            "text": "Part of our sampling and monitoring work helps to inform the water body classifications, for which the Environment Agency is legally obliged to publish a full set of data for every water body in England every 6 years. The last full set was in 2019, with the next in 2025. However, to help with our work, and that of our partners, in the interim we have recently published a limited dataset that was collected between 2019 and 2021."
        },
        {
            "text": "We have deliberately targeted most of our sampling at water bodies with suspected problems so that we can get the evidence for investment (for example, from water companies and partners) where it is most needed. We haven’t included chemical or groundwater status which means not all water bodies have been updated. It is not possible to use this data to update the national ecological status statistic because the data set is not complete, and combining old data from 2019 with the updated data would not give scientifically robust trends."
        },
        {
            "text": "Although we can’t use the data to update England’s ecological status, it does reiterate what we already know: that we need to see improvements in the ecological status of our waters. That is why the Environment Agency is supporting increased investment, tougher enforcement and tighter regulation to make this happen, as set out in the Plan for Water and current cycle of River Basin Management Plans. This is essential if we are to deliver improvements in line with the targets in the Environmental Improvement Plan."
        },
        {
            "text": "The new assessments are now available through Catchment Data Explorer, our online portal which enables users to drill down into our information, from a river basin district to catchment, to water body, to monitoring points all the way through to the Water Quality Archive. By sharing all the information we have collected, our aim is to enable a collaborative resource which will lead to long-lasting and collective solutions to the problems facing water."
        },
        {
            "text": "Longer term, we are investing in ways to improve our river monitoring and give a fuller, more accurate picture of the problems in England’s water bodies. For example, our new long-term ‘river surveillance network’ monitoring programme for rivers will give a national overview of the state of England’s rivers. This network will provide a statistically robust assessment of the health of rivers and how this changes over time at a national scale and over the long term. The current water body classifications cannot do this. This work is being done under the umbrella of the Natural Capital Ecosystem Assessment programme; a Treasury sponsored ambition to improve our ability to evaluate the effectiveness of work to protect and improve the water environment."
        },
        {
            "text": "In addition, we welcome the various emerging citizen science initiatives that contribute valuable information to help everyone involved to identify and prioritise action. We have our own citizen science programme in place to support this across the country, and have created new Environment Agency roles to connect to local citizen science projects."
        },
        {
            "text": "Ultimately, we are committed to trying new evidence and working collaboratively with everyone responsible for the water environment, to find new solutions to the challenges we are all facing. We know what the problems are – we just need the best data to ensure we can solve them."
        }
    ]
}