{
    "url": "https://gott.blog.gov.uk/2023/08/03/what-we-learned-from-civil-service-live/",
    "title": "What we learned from Civil Service Live",
    "authors": [
        "riannastone1"
    ],
    "categories": [
        "events"
    ],
    "pub_date": "2023-08-03T10:00:37+01:00",
    "content": [
        {
            "text": "Last month GOTT attended Civil Service Live, the flagship learning event, in Manchester and London to speak to hundreds of colleagues from across the public sector.  It was a great opportunity to hear different organisations’ approach to innovation and problem solving – It’s safe to say Civil Service Live was a fantastic learning event for the team at GOTT."
        },
        {
            "text": "We’ve put together our key takeaways from speaking to colleagues at the event:"
        },
        {
            "heading": 2,
            "text": "Innovation is everywhere in the public sector"
        },
        {
            "text": "One thing that quickly became clear is that there is a huge amount of innovation going on in the public sector."
        },
        {
            "text": "Departments across government are creating and using new solutions for real-world issues that benefit the economy, society, and the taxpayer."
        },
        {
            "text": "One example of this that was highlighted at the event was ARNOLD from the Department for Education. ARNOLD is a robot that sorts and processes thousands of emails, reducing the time taken to communicate with the public to address their concerns and delivering value to the taxpayer."
        },
        {
            "heading": 2,
            "text": "People are unaware of the Knowledge Assets they have"
        },
        {
            "text": "Civil Servants at different levels were unsure what Knowledge Assets (KAs) are, or that they might create and use them in their day-to-day work."
        },
        {
            "text": "Data, processes, digital tools, and inventions are all examples of Knowledge Assets, and almost everyone who we spoke to realised that a lot of their work relies on these valuable intangible assets."
        },
        {
            "text": "People who visited our stand and got talking with us wanted to know more about how they could identify their assets and share ideas with others who might benefit from them for a different purpose."
        },
        {
            "text": "Our Knowledge Assets Explained videos were a huge help in getting people to realise the value of their KAs and spark interest!"
        },
        {
            "heading": 2,
            "text": "No one likes silos"
        },
        {
            "text": "We heard a clear desire across the public sector to reduce any potential for duplication, and to collaborate more outside of Departments and Arm’s Length Bodies."
        },
        {
            "text": "We were able to point colleagues in the direction of our Knowledge Asset Champions Network which provides a space for colleagues to collaborate and share ideas across government."
        },
        {
            "text": "It was great to make new connections with colleagues and talk to them about how GOTT can support them to further the impact of their work, with funding to support their ideas or by connecting them to our Champions Network."
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "Get in touch"
        },
        {
            "text": "If you’ve got a question, or think you have a Knowledge Asset you want to take further get in touch with our team."
        }
    ]
}