{
    "url": "https://food.blog.gov.uk/2021/06/15/emily-miles-stakeholder-update-consumer-insights-regulatory-reform-and-world-food-safety-day/",
    "title": "Emily Miles’ stakeholder update - consumer insights, regulatory reform, and World Food Safety Day",
    "authors": [
        "Emily Miles, Chief Executive"
    ],
    "categories": [
        "Our mission",
        "Partners"
    ],
    "pub_date": "2021-06-15T15:27:39+01:00",
    "content": [
        {
            "text": "Cymraeg"
        },
        {
            "text": "In her latest update to stakeholders, FSA Chief Executive Emily Miles discusses World Food Safety Day, gives an update on the FSA’s regulatory reform programme, and the latest on consumer insight. Sign up to receive regular updates."
        },
        {
            "text": " "
        },
        {
            "text": "At the FSA we work with consumers, the industry, regulators, and governments to ensure we have food we can trust."
        },
        {
            "text": "World Food Safety Day was last week and at the FSA we focused on the theme of “Keep it Safe”. We shared guidance to help more food businesses re-open and register as they work to recover from the impact of COVID-19. This built on the campaign we ran last year to support the food sector’s recovery from the massive changes brought about by the pandemic."
        },
        {
            "text": "World Food Safety Day is led by the Codex Alimentarius Commission, the global food safety and quality standards setting body. The UK is an active member and I’m very pleased indeed that Steve Wearne, FSA Director, Global Affairs and a Vice-Chairperson of Codex has announced his candidacy for Codex Chairperson. Good luck to Steve for the election in November."
        },
        {
            "text": "At our last Board meeting, we launched the local authority recovery roadmap in response to the ongoing pressures that the pandemic is placing on local authority food teams. In it, the FSA gives guidance to local authorities so that they focus on the highest risk food businesses now and gradually get other work back on track. We are looking forward to working with local authorities to shift the focus from managing the impact of COVID-19 and back onto food standards."
        },
        {
            "text": "We also gave Board members an update on our regulatory reform programme, including progress on our Achieving Business Compliance and agreed proposals on the Future Delivery Model, which is part of our on-going work to transform the way we deliver official controls. We are now going to consult on these plans. If you missed the discussion, you can catch up and find all the papers on our website."
        },
        {
            "text": "As an organisation working in the interests of consumers, it is vital we know what they are thinking to help us inform our work. Most recently we published the latest findings of our COVID-19 Consumer Tracker and the first report from our new ‘Food and You 2’ survey. These findings are being used to help the FSA and other government departments tackle issues including food security and consumer safety, and inform our work with the National Food Strategy."
        },
        {
            "text": "I hope you’ve found this latest message about the FSA useful. If you’d like to get future editions direct to your inbox, sign up for the updates. You can also sign up to be notified of all FSA posts, not just this message."
        },
        {
            "heading": 1,
            "text": "Diweddariad Emily Miles i randdeiliaid – mewnwelediadau defnyddwyr, diwygio rheoleiddiol a Diwrnod Diogelwch Bwyd y Byd"
        },
        {
            "text": "Yn ei diweddariad diweddaraf i randdeiliaid, mae Prif Weithredwr yr Asiantaeth Safonau Bwyd (ASB), Emily Miles, yn trafod Diwrnod Diogelwch Bwyd y Byd, yn rhoi diweddariad ar raglen diwygio rheoleiddio yr ASB, a’r diweddaraf o ran safbwyntiau defnyddwyr. Cofrestrwch i gael diweddariadau rheolaidd."
        },
        {
            "text": "Yn yr ASB rydym yn gweithio gyda defnyddwyr, rheoleiddwyr, diwydiant, a llywodraethau i sicrhau bod gennym fwyd y gallwn ymddiried ynddo."
        },
        {
            "text": "Roedd Diwrnod Diogelwch Bwyd y Byd yr wythnos ddiwethaf, ac fe wnaethom ganolbwyntio ar y thema “Cadw Bwyd yn Ddiogel”. Gwnaethom rannu canllawiau i helpu mwy o fusnesau bwyd i ailagor a chofrestru wrth iddynt ddod dros effaith COVID-19. Fe wnaeth hyn adeiladu ar yr ymgyrch y gwnaethom ei chynnal y llynedd i gefnogi adferiad y sector bwyd o’r newidiadau anferthol a ddaeth yn sgil y pandemig."
        },
        {
            "text": "Arweinir Diwrnod Diogelwch Bwyd y Byd gan Gomisiwn Codex Alimentarius, y corff sy’n gosod safonau diogelwch ac ansawdd bwyd yn fyd-eang. Mae'r DU yn aelod gweithgar ohono, ac mae’n dda iawn gen i fod Steve Wearne, Cyfarwyddwyr Materion Byd-eang yr ASB a Dirprwy Gadeirydd Codex, wedi cyhoeddi ei ymgeisyddiaeth ar gyfer rôl Cadeirydd Codex. Pob lwc i Steve at yr etholiad ym mis Tachwedd."
        },
        {
            "text": "Yn ein cyfarfod Bwrdd diwethaf, fe wnaethom lansio’r cynllun adfer ar gyfer awdurdodau lleol mewn ymateb i’r pwysau parhaus mae’r pandemig yn ei roi ar dimau bwyd awdurdodau lleol. Ynddo, mae’r ASB yn nodi ei ganllawiau ar gyfer awdurdodau lleol fel y gallant ganolbwyntio ar y busnesau bwyd risg uchaf ar hyn o bryd a gweithio’n raddol tuag at gael y gwaith arall ar y trywydd iawn. Rydym yn edrych ymlaen at weithio gydag awdurdodau lleol i symud y ffocws oddi wrth reoli effaith COVID-19 ac yn ôl at safonau bwyd."
        },
        {
            "text": "Fe wnaethom hefyd ddiweddaru aelodau’r Bwrdd ynghylch ein rhaglen diwygio rheoleiddio, gan gynnwys ein cynnydd o ran Sicrhau Cydymffurfiaeth Busnesau a chynigion y cytunwyd arnynt ar gyfer Model Cyflawni’r Dyfodol, sy’n rhan o’n gwaith parhaus i drawsnewid y ffordd rydym yn cyflawni rheolaethau swyddogol. Byddwn nawr yn ymgynghori ar y cynlluniau hyn. Os gwnaethoch golli’r drafodaeth, gallwch ei gwylio eto a dod o hyd i’r holl bapurau ar ein gwefan."
        },
        {
            "text": "Fel sefydliad sy'n gweithio er budd defnyddwyr, mae’n hanfodol ein bod yn gwybod beth maent yn ei feddwl er mwyn ein helpu i lywio ein gwaith. Yn fwyaf diweddar, fe wnaethom gyhoeddi canfyddiadau ein Harolwg Tracio Defnyddwyr COVID-19, ac adroddiad cyntaf ein harolwg newydd ‘Bwyd a Chi 2’. Mae'r canfyddiadau hyn yn cael eu defnyddio i helpu’r ASB ac adrannau llywodraethol eraill i fynd i’r afael â materion megis diogelwch bwyd a diogelu defnyddwyr, gan lywio ein gwaith gyda’r Strategaeth Fwyd Genedlaethol."
        },
        {
            "text": "Rwy’n gobeithio i chi gael y neges ddiweddaraf hon ynghylch blaenoriaethau’r ASB yn ddefnyddiol. Os hoffech gael rhifynnau’r dyfodol yn uniongyrchol i’ch mewnflwch, cofrestrwch am y diweddariadau. Gallwch hefyd gofrestru i gael eich hysbysu am bob blog gan yr ASB, ac nid y neges hon yn uni."
        }
    ]
}