{
    "url": "https://ipa.blog.gov.uk/2021/06/15/ipa-international-and-the-global-infrastructure-programme-improving-infrastructure-project-preparation-worldwide/",
    "title": "IPA International and the Global Infrastructure Programme: improving infrastructure project preparation worldwide",
    "authors": [
        "Tom Hill"
    ],
    "categories": [
        "Infrastructure",
        "IPA International",
        "Major projects"
    ],
    "pub_date": "2021-06-15T15:45:07+01:00",
    "content": [
        {
            "text": "Project Preparation and the Global Infrastructure Gap"
        },
        {
            "text": "As the world begins to emerge from the pandemic, countries are putting infrastructure at the heart of their recovery plans. There is a growing ambition to build back fairer, faster, and greener - seizing the opportunity to rebuild towards a more sustainable future. Now, more than ever, it is important for countries to plan and spend scarce resources wisely. All too often however, projects are put forward without the vital early stage thinking and structured development needed for them to be implemented successfully and to attract international investment."
        },
        {
            "text": "Over the past few years, the Infrastructure and Projects Authority’s International team have been leading the operational roll-out of the Global Infrastructure Programme (GIP), an innovative £16m aid programme funded by the FCDO’s Prosperity Fund."
        },
        {
            "text": "IPA International has worked with countries such as Indonesia, Colombia, Brazil, Peru, South Africa and Mexico, adapting and deploying world -leading technologies, setting up large scale training programmes for government officials, and, in the case of Colombia and Indonesia, helping fund demonstrator projects to showcase these new approaches. In this way the UK is helping these countries set up their infrastructure projects for success and opens the door for leading UK companies to support these vital rebuilding programmes."
        },
        {
            "text": "Global Infrastructure Programme: harnessing Project Development Routemap and the 5 Case Model"
        },
        {
            "text": "At the heart of this programme are two of the UK’s renowned methodologies for project preparation: the 5 Case Model and the Project Development Routemap (known as Project Routemap in the UK). The 5 Case Model (5CM) is a business case development tool widely used across central, devolved and local governments in the UK and in other countries worldwide. It provides a framework for thinking and developing the case for any project . It looks at the project through five different lenses and charts its progress through 45 different steps in a structured way. Figure 1 shows the ‘five cases’."
        },
        {
            "text": "The Project Development Routemap (Routemap) is the UK government’s support tool for novel and complex projects. It helps people responsible for delivering projects to understand the capabilities they need to set up for success. Routemap aligns with international best practice, such as the G20 Principles for the Project Preparation Phase, and incorporates learning from other major projects and programmes."
        },
        {
            "text": "Routemap helps projects consider their capabilities across people, processes, systems, governance, and ways of working. The tool looks at the entire project system, from sponsor through to the supply chain and asset managers and provides a collaborative way for stakeholders to work together, toward practical solutions, to address gaps in capability. Routemap is particularly useful when a project team lacks routine experience of delivering a particular project or they want to know the capabilities they need to succeed."
        },
        {
            "text": "GIP key achievements"
        },
        {
            "text": "In designing their approach to the GIP, IPA International set out to deliver a programme with a difference by combining policy influence, training, and investment in order to achieve lasting, sustainable change. With the programme completed in March 2021, IPA International is happy to report significant results across all these areas."
        },
        {
            "text": "Through the programme, there is now an international version of the UK’s Five Case Model for infrastructure projects and Project Development Routemap international handbook and seven best practice modules. Both sets of guidance have been adapted further to both Indonesia and Colombian contexts – having been translated into Bahasa Indonesia and Spanish respectively."
        },
        {
            "text": "Through our mass training programmes, delivered by our programme partners, PwC and STEER Colombia, 1360 people across 15 countries have now been trained in either or both of the 5CM and PDR methodologies. Given that gender and inclusion was a strong focus for the GIP, it was encouraging to see that 42% of people trained were women. Figure 3 shows the full geographic spread of the training courses."
        },
        {
            "text": "These training courses were initially planned to be held face-to-face, but only a few of these in-person training sessions were delivered before the COVID-19 pandemic led to mass home working and halted international travel."
        },
        {
            "text": "Despite this setback, the programme quickly adapted to delivering the courses online. If anything, virtual training had its benefits – for example in Indonesia, the virtual training meant that courses could be delivered more easily to regional as well as central government officials. The programme has demonstrated how mass capacity building can be effectively delivered through virtual ways of working."
        },
        {
            "text": "In Indonesia, the 5CM and Routemap are now being embedded through formal policy commitments. The Indonesian government has made implementing the methodologies part of their Government Work Plan for 2021, which has been formalised by a presidential decree. Key aspects of the Five Case Model principles, such as the ‘options framework’, have been integrated into the revised PPP regulation in Indonesia. In Colombia, both the 5CM and PDR have also been endorsed by the office of the President."
        },
        {
            "text": "As well as the high-level policy commitments and mass training of officials, both the 5 Case Model and Routemap are now actually being applied to major strategic infrastructure projects in both Colombia and Indonesia."
        },
        {
            "text": "In Indonesia, IPA have collaborated with the World Bank to deliver an Early Business Case structured around the 5CM for a potential mass transit project in the city of Bandung in West Java. We also collaborated with the World Bank to successfully apply the Routemap to this project, working with stakeholders to uncover capability challenges in project development and build an action plan to address them."
        },
        {
            "text": "In Colombia, the IPA is now a leading partner in a Pre-Investment Fund together with the Colombian national development bank (FDN) and the Inter-American Development Bank (IDB). This Fund will co-finance pre-feasibility and feasibility studies for major strategic infrastructure projects in the country, embedding 5CM and Routemap principles."
        },
        {
            "text": "Looking forward: embedding sustainability in infrastructure project preparation"
        },
        {
            "text": "With the GIP now completed, the International team will continue to work with its partners in Indonesia, Colombia, and beyond to improve their infrastructure project preparation systems. Recently, the IPA International team held two Sustainable Infrastructure Courses for senior officials involved in infrastructure delivery, one for those in the South East Asian region and another for those in Latin America."
        },
        {
            "text": "A key message emerging from these courses is that long-term climate change strategies must be at the heart of future infrastructure planning and project preparation. IPA International is currently updating its international 5 Case Model guidance to more systematically address considerations of climate change throughout the business case development process. This updated guidance will be launched in the summer and will provide a practical tool to embed climate change principles in projects going forward."
        },
        {
            "text": "The international Routemap materials already have a strong sustainability lens - IPA International will be building on this foundation and developing new guidance in areas such as asset resilience and Environmental, Social and Governance principles. Ahead of the UK’s presidency of COP26, technical assistance to help countries meet their long-term climate change strategies will only grow in importance - with its updated methodologies IPA International stands well-prepared to deliver this."
        },
        {
            "text": "Further reading: Global Infrastructure Programme: IPA Key Results"
        }
    ]
}