{
    "url": "https://competitionandmarkets.blog.gov.uk/2021/06/15/new-secondment-opportunities-for-competition-lawyers/",
    "title": "Secondment opportunities for competition lawyers",
    "authors": [
        "Nigel Machin"
    ],
    "categories": [
        "Life at the CMA"
    ],
    "pub_date": "2021-06-15T16:20:27+01:00",
    "content": [
        {
            "text": "We are launching a new round of secondment opportunities for competition lawyers, to start on 1 September 2021."
        },
        {
            "text": "Since its launch in June 2018, more than 30 secondees from over 20 law firms have taken part in the programme and we are now accepting applications for the next round which will start on 1 September 2021."
        },
        {
            "text": "We invite you to consider whether your firm and any of your associates wish to participate."
        },
        {
            "text": "The deadline for applications is Monday 28 June 2021 and you can find out more below."
        },
        {
            "text": "We believe our programme offers an exciting opportunity for competition lawyers:"
        },
        {
            "heading": 2,
            "text": "Application details"
        },
        {
            "text": "Secondments are open to all UK and EU qualified lawyers currently employed in a law firm, and with previous experience working on competition law matters."
        },
        {
            "text": "Furthermore:"
        },
        {
            "text": "Firms that would like to put candidates forward should email a CV and covering letter for each candidate by Monday 28 June 2021 to Ronan Flanagan, Jenny Coombes, Nigel Machin and Amy Batchelor (at the contact details set out below)."
        },
        {
            "text": "As part of their covering letter, candidates should confirm that they are able to start their secondment on 1 September 2021 for a 6 month period."
        },
        {
            "text": "They should also express any preference for particular types of work within the CMA which we will do our best to accommodate, including with a view to maximising a firm’s exposure to different CMA tools among their associates seconded over time."
        },
        {
            "text": "Candidates should be available to have a meeting or call with the CMA during the weeks of either 5 July 2021 or 12 July 2021 to discuss the secondment."
        },
        {
            "text": "Please note we will not accept applications from agencies."
        },
        {
            "text": "If you have any questions or would like to discuss the benefits of the programme, please contact any of Ronan Flanagan, Jenny Coombes, Nigel Machin or Amy Batchelor."
        },
        {
            "heading": 3,
            "text": "Contact details for secondment programme queries:"
        },
        {
            "heading": 4,
            "text": "Ronan Flanagan"
        },
        {
            "text": "Legal Director, ronan.flanagan@cma.gov.uk 020 3738 6142"
        },
        {
            "heading": 4,
            "text": "Jenny Coombes"
        },
        {
            "text": "Legal Director, jenny.coombes@cma.gov.uk 020 3738 6445"
        },
        {
            "heading": 4,
            "text": "Amy Batchelor"
        },
        {
            "text": "Legal Adviser, amy.batchelor@cma.gov.uk 020 3738 6080"
        },
        {
            "heading": 4,
            "text": "Nigel Machin"
        },
        {
            "text": "Legal Adviser, nigel.machin@cma.gov.uk 020 3738 6083"
        }
    ]
}