{
    "url": "https://socialworkers.blog.gov.uk/2021/06/15/south-west-london-surrey-social-work-teaching-partnership-attracting-developing-and-retaining-the-best-and-the-brightest-social-workers/",
    "title": "South West London & Surrey Social Work Teaching Partnership: Attracting, developing and retaining the best and the brightest social workers",
    "authors": [
        "Libbi Aldred"
    ],
    "categories": [
        "CPD",
        "Social Work Students"
    ],
    "pub_date": "2021-06-15T11:12:11+01:00",
    "content": [
        {
            "heading": 4,
            "text": "The Department for Education (DfE) is expanding the Social Work Teaching Partnership Programme, inviting local authorities (LAs) and universities, not already involved in the programme, to apply to take part for 2021/2022."
        },
        {
            "heading": 4,
            "text": "The programme aims to strengthen collaborations between LAs and universities to ensure a steady stream of high-calibre social workers to the frontline, working with children, families, and adults."
        },
        {
            "heading": 4,
            "text": "Libbi Aldred is the Partnership Project Lead for Developing Together: Social Work Teaching Partnership. Here, she discusses the benefits of getting involved in the Teaching Partnership Programme."
        },
        {
            "text": " "
        },
        {
            "text": "In April 2020, the Developing Together partnership was successful in its application to the DfE for sustainability funding, along with internal financing, and is now self-sustaining until March 2023. The partnership builds on an existing collaboration between the South West London and Surrey Social Work Alliance, running since 2008."
        },
        {
            "text": "The partnership is led by social work senior managers within LAs, the voluntary sector, and social work senior academics within Kingston University. It brings together Principal Social Workers (PSWs), Workforce Development Leads, social work academics and researchers, practice educators, frontline practitioners, and young people and adults who have experienced social care."
        },
        {
            "text": "Our vision is to leverage the strengths of our partners to create the UK’s leading pre and post-qualifying social work education community capable of attracting, developing and retaining the best and brightest social workers in the country."
        },
        {
            "heading": 2,
            "text": "A wealth of benefits to those studying and working in the region"
        },
        {
            "heading": 3,
            "text": "Stimulating and rewarding practice placements"
        },
        {
            "text": "One of the key advantages to studying within our Teaching Partnership (TP) is the access students have to stimulating and rewarding practice placements in the local region. The vast majority of students receive 2 statutory placements but we also offer students the chance to access valuable experience in the voluntary sector by spending a number of placement days with our Private, Voluntary and Independent partners, such as NSPCC and Welcare. Placements are also supported by our Partnership Practice Consultants and overseen by a group of representatives from across the partnership to ensure the quality and consistency of practice education."
        },
        {
            "heading": 3,
            "text": "Teaching consultants who bring theory to life"
        },
        {
            "text": "We also have a significant number of joint appointments across practice and academia, including twenty teaching consultants. These are practitioners who work for local employers and have responsibility for statutory social work. They teach on the qualifying programmes at Kingston University bringing theory to life with their experiences of frontline practice. In addition, they support the recruitment of prospective students onto the qualifying programmes and get involved in research projects relevant to their area of expertise. Most recently, in response to a lack of research on Black Men in Social Work, Kingston University was keen to create a space where people’s stories could be heard and understood. They undertook the initial filming for this project on-site at Kingston University and the London Borough of Croydon, with 19 men being interviewed from Croydon. There are remarkable stories of resilience and determination, a commitment to social work values and of making history."
        },
        {
            "heading": 3,
            "text": "Comprehensive support securing employment"
        },
        {
            "text": "When the time comes to apply to become a newly qualified social worker (NQSW), employability skills workshops are hosted by the partnership to maximise students’ chances of securing employment upon completion of their course. These sessions include practical advice and guidance on writing a CV, interview questions and tips, interview practice and what to expect from the Assessed and Supported Year in Employment (ASYE)."
        },
        {
            "text": "Once employed as an NQSW in the partnership, social workers have access to an excellent ASYE Programme that exceeds national requirements. After the ASYE, as part of a social work career journey, practitioners will transition onto our Early Professional Development (EPD) Framework which offers a comprehensive range of varied learning and support opportunities. The EPD Framework allows practitioners who are 2-3 years post-qualifying to develop as a qualified social worker and build resilience, professional curiosity, leadership, mentoring and project skills."
        },
        {
            "heading": 3,
            "text": "A clear illustration of progression routes"
        },
        {
            "text": "Beyond this, social workers will also be able to take advantage of our social work-specific Career Pathways & Continuing Professional Development (CPD) Framework, which was developed collaboratively with local employers and Kingston University to provide social workers with a clear illustration of their possible progression routes, not limited to a linear management route. Social workers (and students) also have access to the TP’s comprehensive annual CPD offer. We provide in excess of 100 learning and development (L&D) opportunities per year, complementing local employers’ internal L&D offers."
        },
        {
            "heading": 2,
            "text": "My advice for those considering getting involved in the Teaching Partnership Programme"
        }
    ]
}