{
    "url": "https://phescreening.blog.gov.uk/2021/06/15/tomosynthesis-training-update/",
    "title": "Tomosynthesis – training requirement update for staff reporting images",
    "authors": [
        "Claire Borrelli"
    ],
    "categories": [
        "NHS Breast Screening Programme"
    ],
    "pub_date": "2021-06-15T17:00:57+01:00",
    "content": [
        {
            "text": "NHS breast screening services have procured a lot of new mammography equipment over the past 2 years to replace older machinery. This has resulted in a demand for training in using digital breast tomosynthesis (DBT)."
        },
        {
            "text": "The training requirements for staff reporting DBT images within the NHS breast screening programme (BSP) have been revised."
        },
        {
            "text": "It is no longer a mandatory requirement for staff using this modality to attend an NHS BSP training course in tomosynthesis at one of the national training centres. This is in response to the coronavirus (COVID-19) pandemic during which there has been a reduction in face to face study days. However, some staff may still be able to attend a course if current COVID-19 restrictions allow."
        },
        {
            "heading": 2,
            "text": "Staff interpreting DBT"
        },
        {
            "text": "Before breast radiologists, breast clinicians, advanced and consultant practitioners undertake clinical use and reporting of images, there is a mandatory requirement to complete modules on:"
        },
        {
            "text": "Image review of a minimum of 60 cases (preferably a mixture of images provided by all current DBT manufacturers) is crucial to learning DBT technique and an important element of training. There is a template for reporting images and sharing with the experienced second reader. This may be helpful for reflective practice and provides evidence of performance at appraisal."
        },
        {
            "heading": 2,
            "text": "Staff performing DBT"
        },
        {
            "text": "The training requirements for staff taking DBT images has not changed. Mammographers should complete equipment-specific training provided by the manufacturer."
        },
        {
            "heading": 2,
            "text": "PHE Screening blog"
        },
        {
            "text": "The PHE Screening blog provides up to date news from all NHS screening programmes. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new blogs. If you have any questions about this blog article, or about population screening in England, please contact the PHE screening helpdesk."
        }
    ]
}