{
    "url": "https://environmentagency.blog.gov.uk/2021/06/15/visiting-the-river-wharfe/",
    "title": "Visiting the River Wharfe",
    "authors": [
        "pressoffice"
    ],
    "categories": [
        "Water"
    ],
    "pub_date": "2021-06-15T14:12:28+00:00",
    "content": [
        {
            "text": "The Chair of the Environment Agency, Emma Howard Boyd, visited the River Wharfe in Ilkley, Yorkshire, last week."
        },
        {
            "text": "While she was there she met Liz Barber, CEO of Yorkshire Water, Roger Falconer, chair of the Wharfe Partnership, and Karen Shackleton, Rick Battarbee and Kathleen Roberts from the Ilkley Clean River Campaign. The group discussed the challenges facing the local water environment including the huge issues posed by wet wipes and other forms of sewer misuse, as well as potential solutions for the area. This included a visit to Ilkley Tarn to discuss the options for holding back water from the sewer network, and the Ashlands Wastewater Treatment Works to consider the scope for increased storage."
        },
        {
            "text": "The River Wharfe, which is a popular swimming spot for locals and tourists, recently became the first river in England to be designated as a bathing site."
        },
        {
            "text": "That means that water quality in part of the river is now being regularly monitored by the Environment Agency to assess bacteria levels. This in turns helps assess what action is needed by water companies, land owners and others to make sure the water is clean and safe for swimmers."
        },
        {
            "text": "While the designation of the River Wharfe is a landmark step in bringing about changes to water quality, it will require long-term collaboration, investment and innovation."
        },
        {
            "text": "Last year Yorkshire Water announced the Wharfe Partnership, bringing together the Environment Agency, the National Trust, Yorkshire Wildlife Trust and the Yorkshire Dales Rivers Trust, alongside Bradford Council, the CLA and others to look at the impacts on water quality across the catchment, including from agriculture."
        },
        {
            "text": "The Environment Agency continues to play an active part in the work coordinated by the Yorkshire Dales River Trust which works on projects across the wider catchment. It also recently hosted a Citizens’ Jury event to hear views from the public and environmental experts on all aspects of the water environment in the area."
        },
        {
            "text": "The monitoring at Ilkley is being carried out at the Cromwheel sampling point between Ilkley Old Bridge and the suspension bridge, which is where most bathers are expected to use the water. The EA will also be carrying out further monitoring at a location downstream of the suspension bridge and Ashlands Wastewater Treatment Works."
        },
        {
            "text": "Chair of the Environment Agency Emma Howard Boyd said:"
        },
        {
            "text": "Liz Barber, Yorkshire Water CEO said:"
        },
        {
            "text": "Karen Shackleton, founder of the Ilkley Clean River Group, said:"
        },
        {
            "text": "Bathing water sites in England have been monitored by the Environment Agency since the 1990s and since have seen a significant improvement in water quality. In the 1990s just 28% of bathing waters met the highest standards in force at that time. In 2019, 98.3% of bathing waters met the minimum standard, with 93.3% reaching the highest standards of Excellent or Good."
        },
        {
            "text": "Anyone can check the quality of the water before visiting a bathing site by going to the EA’s Swimfo website."
        }
    ]
}