{
    "url": "https://civilservice.blog.gov.uk/2021/06/15/yes-minister/",
    "title": "Yes, Minister",
    "authors": [
        "Pamela Dow, Executive Director, Government Skills and Curriculum Unit"
    ],
    "categories": [
        "Civil Service Leaders",
        "Civil Service Learning"
    ],
    "pub_date": "2021-06-15T10:23:35+00:00",
    "content": [
        {
            "text": "Behind every government minister is an indispensable team. Pamela Dow on how a decade old ambition to better support those who support ministers finally came to life."
        },
        {
            "text": "When more than 700 colleagues across 21 departments, and 12 arms length bodies (ALBs), attend a full day’s training conference on a Friday, you know there’s an appetite for skills, knowledge and networks.  "
        },
        {
            "text": "Ever since leading a private office myself, now over 10 years ago, I've learned two indisputable truths."
        },
        {
            "text": "Based on a format we know to be effective, a truly x-government team from Government Skills and Curriculum Unit (GSCU), Private Office Network, Policy Profession, Propriety and Ethics designed and delivered a conference titled Supporting Ministers to Lead."
        },
        {
            "text": "Sessions led by experienced colleagues ranged from parliamentary basics to the importance of communicating well, demystifying boards and working with NEBMs (Non-Executive Board Members), and the value of using scientific advisers. "
        },
        {
            "text": "Highlights for me included the conversations with Shona Dunn on delivering a national policy priority, and a teach-in by DWP’s James Doughty on writing well. The day started and ended with insightful and informal conversations with the Lord Chancellor Robert Buckland, Cabinet Office Minister Julia Lopez, and CDL Michael Gove. Hearing them describe what it means to walk into a new department, and how to juggle family and political life was memorable. "
        },
        {
            "text": "What did we learn?"
        },
        {
            "text": "Creating the environment where good decisions are made... "
        },
        {
            "text": "This was the thread that linked every session, from the Q&A with Non-Executive Board Members about the extra perspective they can bring, to the discussion about the scientific method in government with a Chief Science Adviser. "
        },
        {
            "text": "Supporting ministers is a collective endeavour"
        },
        {
            "text": "And those working in private offices rely on the knowledge, skills, spirit and networks of the whole Civil Service. People in frontline delivery have crucial understanding which contributes to policy making discussions. "
        },
        {
            "text": "The seemingly mundane things matter too. No-one makes good decisions when they’re tired, hungry, or haven’t had enough time to read a briefing, or  rushing from meeting to meeting with no time to think. The skills of diary and meeting management are hard, important, and transferable to most roles in government and beyond. "
        },
        {
            "text": "Clarity, brevity, precision… "
        },
        {
            "text": "The commodity in the highest demand, and shortest supply, is a minister’s time. Writing clearly, and speaking succinctly, don’t just lead to better outcomes, they're a mark of respect. All unnecessary words, imprecise explanation, and vague advice, represent unnecessary extra minutes which could be better spent on more urgent matters. "
        },
        {
            "text": "Ministers are humans too! "
        },
        {
            "text": "In both the opening panel and closing interview, we got a glimpse into the realities of ministerial life. The volume and scale of decisions they are expected to make every day. "
        },
        {
            "text": "The new language, knowledge and networks they need to learn quickly, in Parliament, and in a new department. They have families, friends, and constituents. One of the most important skills we need in working with them, effectively, is empathy. "
        },
        {
            "text": "Ministers need to know they have the support of the officials with whom they work most closely, without in any way detracting from the Civil Service Code of Honesty, Objectivity, Integrity, and Impartiality. This is neatly demonstrated in Yes Minister, in an exchange between Jim Hacker and Bernard, his Principal Private Secretary: "
        },
        {
            "text": "“You mean that when the chips are down, you'll be on my side, not Sir Humphrey's?”"
        },
        {
            "text": "“Minister, it is my job to see that the chips stay up!”"
        },
        {
            "text": "This event has proven a concept, and helped shape the content of both the forthcoming ministerial training/induction programme, and strands 1 and 2 of the new curriculum. "
        },
        {
            "text": "The ambition is to run the same event on a rolling basis to respond to demand, and also borrow the format for other themes. A prospectus will be available at the end of June 2021. "
        },
        {
            "text": "To find out more about the ministerial induction programme and wider Government Campus visit www.gov.uk/gscu."
        }
    ]
}