{
    "url": "https://deframedia.blog.gov.uk/2023/02/02/coverage-on-avian-influenza-in-non-avian-wild-mammals/",
    "title": "Coverage on avian influenza in non-avian wild mammals",
    "authors": [
        "Defra Press Office"
    ],
    "categories": [
        "Weekly stories"
    ],
    "pub_date": "2023-02-02T17:32:20+00:00",
    "content": [
        {
            "text": "There has been coverage on BBC News today on avian flu ‘spilling over’ into mammals, including otters and foxes in the UK."
        },
        {
            "text": "Their reporting focuses on data shared  with the BBC by the World Organisation for Animal Health (WOAH). The presence of avian influenza in mammals is not new, nor is the ‘spillover’ in the UK. We published our reporting on it in December."
        },
        {
            "text": "The report was based on samples taken as part of routine wildlife surveillance over the last year which detected the presence of H5N1 influenza of avian origin in 5 foxes and 4 otters. We cannot determine with certainty whether influenza of avian origin was the sole cause of death in these wild animals and it is possible other factors may have contributed."
        },
        {
            "text": "The Animal Plant Health Agency target  mammal surveillance is based on risk. The mammals we test for avian flu are all at a high risk of infection,  for example the deceased animal may have been found in the close vicinity to a large number of wild bird dead birds caused by bird flu."
        },
        {
            "text": "Scavenging mammals that will be opportunistic and predate on infectious dead or sick birds will be exposed to very large quantities of virus. That gives a possibility for the virus to enter a host population that it doesn't normally maintain in."
        },
        {
            "text": "There is a very low likelihood of any widespread infection in GB mammals and the evidence  does not suggest that – we are talking about isolated incidents where mammals have come into very close contact with the virus. Infection of mammals with influenza of avian origin remains uncommon and the risk of the H5N1 strain to non-avian UK wildlife remains low."
        },
        {
            "text": "The available genomic surveillance data reported by the Animal Plant and Health Agency (APHA) in the UK does not suggest widespread mammalian adaption of the virus."
        },
        {
            "text": "Professor Ian Brown, Animal Plant and Health Agency said: "
        },
        {
            "text": "The UK Health Security Agency (UKHSA) advises there is no increased risk to the general public from bird flu and that the avian influenza viruses do not spread easily to people."
        },
        {
            "text": "The UKHSA are closely monitoring the disease and are working with the Animal Plant and Health Agency to regularly publish updates on the latest surveillance data."
        },
        {
            "text": "In response to the unprecedented global outbreak of H5N1 avian influenza, the UK's avian influenza national reference laboratory has increased its surveillance of cases in mammals and genome analysis of the virus itself while keeping a close eye on its spread in global populations of wild birds."
        },
        {
            "text": "The UK has some of the toughest biosecurity measures in the world, and we have taken swift action to protect flocks from the threat of bird flu. All poultry and captive birds must be housed in England until further notice. Bird keepers are required to shut their birds indoors and implement strict biosecurity measures to help protect their flocks from the threat of avian influenza, regardless of whatever type or size. Introducing these steps on farm is the most effective way in reducing the risk of disease spreading."
        }
    ]
}