{
    "url": "https://dragonsden.blog.gov.uk/2023/02/02/dragons-den-episode-5-series-20/",
    "title": "Dragons’ Den, Episode 5, Series 20",
    "authors": [
        "Laurien Webb"
    ],
    "categories": [
        "Designs",
        "IP",
        "Patents"
    ],
    "pub_date": "2023-02-02T21:05:07+00:00",
    "content": [
        {
            "text": "A real mixed bag in tonight’s episode. From van alarms to fashion, bag pipes to apps – it just goes to show that IP affects every area of business. However, there was one thing the entrepreneurs had in common...they were seeking that all important investment from the Dragons."
        },
        {
            "heading": 2,
            "text": "“You just mentioned IP”"
        },
        {
            "text": "First up in the Den, we had entrepreneur and inventor Michael Horsfall, asking for 45k in exchange for 10% of his Van Guardian business. Michael had been inspired to start his business after he became the victim of theft and decided to put himself forward to tackle van crime. But did he drive off with a deal?"
        },
        {
            "text": "Van Guardian was described as an alarm product like no other. It goes off before anyone even opens the vehicle door, alerting owners before the crime has been committed. I was left thinking, this is perfect! Surely prevention is better than cure?"
        },
        {
            "text": "Touker Suleyman was first up to breathe his fiery questions at Michael, asking him what IP he owned, which left Michael a bit flummoxed. I know that it can be tricky to explain IP in an easy way, especially when it comes to patents, so let me break it down…"
        },
        {
            "text": "You should only apply for a patent if:"
        },
        {
            "text": "It’s worth noting that having a patent will not guarantee your invention will make money. You should therefore carefully consider if a patent is worth the cost to you and your business before you apply. You can get free advice on whether a patent is right for you from:"
        },
        {
            "text": "With Michael admitting he was left feeling battered after the Dragons’ grilling, it wasn’t long before the last Dragon, Touker, declared himself out. We wish Michael all the best with his business."
        },
        {
            "heading": 2,
            "text": "“Nothing beats the sea”"
        },
        {
            "text": "The next entrepreneur to enter the Den was Moray Luke, who instantly had me invested in her pitch as I have a self-confessed passion for fashion! Moray was asking for a 30k investment for 20% of her brand-new handbag business, which were made from fish skin."
        },
        {
            "text": "  "
        },
        {
            "text": "It wasn’t long before Steven Bartlett, followed by Touker, took the moment to strut their stuff with their eye watering attempts at a catwalk, swinging the aesthetically pleasing bags at their sides."
        },
        {
            "text": "Moray was inspired to make the bags after discovering the wastage in the Scottish salmon industry and thought the left-over fish skin could be put to good use. I must admit, I thought it was a genius idea and what a beautiful result. This left me thinking about design protection."
        },
        {
            "heading": 2,
            "text": "How can you protect fashion designs?"
        },
        {
            "text": "Designers can use unregistered designs to protect their creations, since the design of the product can change quickly and there may not always be time to apply for a registered design. "
        },
        {
            "text": "Unregistered designs are automatic and protect the shape and configuration of your product for either 10 years after it was first sold, or 15 years after it is created. They also protect the physical appearance of your product for 3 years from when you go public with your design. Find out more about unregistered designs by visiting our website."
        },
        {
            "text": "There isn’t a register for these rights. However, you can prove your design protection by registering your designs or  you can ask a solicitor to keep certified copies of your unregistered design as a record."
        },
        {
            "heading": 2,
            "text": "Choppy waters? "
        },
        {
            "text": "Things were getting salty back in the Den, as the Dragons’ discussed the branding and the potential future of Moray’s business. So just how important is branding to your customer?"
        },
        {
            "text": "When it comes to business, branding can be everything. Many people refer to their trade mark as their brand, although a brand is more than just a company logo. It can influence the way your customer perceives you when they hear or think of your company name, service, or product."
        },
        {
            "text": "Unfortunately for Moray, the Dragons’ collectively felt that it was too early for an investment, but she did leave the Den with a direct line to the fashion industry with an offer of mentorship from Touker. Good luck Moray – I hope to sea your bags making waves soon."
        },
        {
            "heading": 2,
            "text": "How the IPO can help your business  "
        }
    ]
}