{
    "url": "https://educationhub.blog.gov.uk/2023/02/02/everything-you-need-to-know-about-the-lifelong-learning-bill/",
    "title": "Everything you need to know about the Lifelong Learning Bill",
    "authors": [
        "Media Officer"
    ],
    "categories": [
        "Adult learning",
        "Skills"
    ],
    "pub_date": "2023-02-02T16:44:07+00:00",
    "content": [
        {
            "text": "The Lifelong Learning (Higher Education Fee Limits) Bill has been introduced in parliament, which will allow for the Government’s Lifelong Loan Entitlement (LLE) to be rolled out from 2025. But what does this mean for you? Here we explain:"
        },
        {
            "heading": 3,
            "text": "What is the Lifelong Loan Entitlement?"
        },
        {
            "text": "The LLE is part of the Government’s reforms to post-18 education and training, which aim to support more people to access high-quality courses that meet the skills needs of employers, and that will get them into good jobs."
        },
        {
            "text": "From 2025, the LLE will offer people a loan worth £37,000 in today’s tuition fees, which can be used flexibly over their working lives to pay for short courses, modules or full courses, whether at college or at university."
        },
        {
            "heading": 3,
            "text": "How will this support students?"
        },
        {
            "text": " This will create more flexibility for people to decide when they want to study, throughout their career, helping them to upskill and progress."
        },
        {
            "heading": 3,
            "text": " How does the Bill support the LLE?"
        },
        {
            "text": "The Bill will mean that from 2025, universities and colleges will be required to use a new method for calculating the maximum level of tuition fees they can charge for different courses. It will make the pricing of modules and short courses proportionate, so all students can access these courses at a fair price and encouraging more people to study more flexible in a way that works for them."
        },
        {
            "text": "The Bill will:"
        },
        {
            "text": "Following the introduction of the Bill, it will progress through Parliament before being made into law."
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}