{
    "url": "https://educationhub.blog.gov.uk/2023/02/02/how-we-are-improving-our-support-for-vulnerable-children-and-families/",
    "title": "How we are improving our support for vulnerable children and families ",
    "authors": [
        "media officer"
    ],
    "categories": [
        "Child protection",
        "children in care",
        "Foster Carer",
        "Fostering",
        "Looked after children",
        "Social work"
    ],
    "pub_date": "2023-02-02T10:59:38+00:00",
    "content": [
        {
            "text": "Children’s social care plays an invaluable role in supporting and protecting the most vulnerable children."
        },
        {
            "text": "Here’s what you need to know about our ambitious plans to reform support for children in care and the children’s social care system.  "
        },
        {
            "text": "What are you doing to improve the children’s social care system? "
        },
        {
            "heading": 3,
            "text": " "
        },
        {
            "text": "Backed by £200 million over the next two years, ‘Stable Homes, Built on Love’ is the government’s plan for how we make the children’s social care system work better. "
        },
        {
            "text": " "
        },
        {
            "text": "Families and loving relationships are at the heart of the plan, with a focus on early help and support for those that are struggling. "
        },
        {
            "heading": 3,
            "text": "How will the new plan support vulnerable children and families?  "
        },
        {
            "text": " The plan is a move away from the current model of intervention to focus instead on effective early help and support within families.  "
        },
        {
            "text": " "
        },
        {
            "text": "Proposals in the strategy include a trialling a new Family Help programme which will provide joined-up help for families needing support with issues such as domestic abuse or poor mental health.  At the moment, when families need help from children’s social care, they often go through lots of meetings with different people. The earlier we help a struggling family, the less likely their problems will worsen, and the less likely children will be taken into care."
        },
        {
            "text": " "
        },
        {
            "text": "Where a child is at risk of serious harm, child protection will be more decisive and effective. In the future, social workers, nurses, doctors, police officers and teachers will work better together to keep children safe. They should talk to children, their parents and family members about how best they can help. "
        },
        {
            "text": " "
        },
        {
            "text": "When a child can’t live with their parents, the social workers will look to help extended families, such as grandparents, aunties and uncles to provide stable homes for children in what are known as ‘kinship care’ arrangements or look to place children in high quality foster placements. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "What is kinship care and how does this plan support that? "
        },
        {
            "text": " If children can’t live with their parents, they should live with someone they already know, love and trust if it is possible and safe – this is called kinship care.  "
        },
        {
            "text": " "
        },
        {
            "text": "We want to give more help to children and their kinship carers. We plan to test new ways of supporting kinship care and children with ‘Family Network Support Packages’ in up to 19 different parts of the country. These packages are different types of help that local authorities can give to kinship carers, like helping them build an extra bedroom or giving them some extra money to pay for things a child needs. "
        },
        {
            "text": " "
        },
        {
            "text": "We will also offer training to all kinship carers in the country to support them in caring for a child. "
        },
        {
            "text": " "
        },
        {
            "heading": 3,
            "text": "What about children and young people that need to be placed in care? What support will there be for them?  "
        },
        {
            "text": " We want to support children to stay with their families. But even with greater help for families, sometimes children need to come into care to keep them safe.  "
        },
        {
            "text": " "
        },
        {
            "text": "In cases where wider family is unable to offer support, the strategy will create a care system that provides the same love and stability that all children deserve with plans to attract more foster carers to provide a loving home."
        },
        {
            "text": " "
        },
        {
            "text": "For foster care, we are investing £25 million over the next two years in a recruitment and retention programme, which is the largest investment in recent history. Depending on local need, foster care recruitment will focus on areas where there is a particular shortage of placements for children such as sibling groups, teenagers, unaccompanied asylum seeking children (UASC), those that have suffered complex trauma or parent and child foster homes."
        },
        {
            "text": " "
        },
        {
            "text": "Foster carers will also see an above-inflation increase in their allowance to help cover the increasing costs of caring for a child in their home, in recognition of the brilliant care they provide to children.   "
        },
        {
            "heading": 3,
            "text": "  "
        },
        {
            "heading": 3,
            "text": "What about support for social workers?  "
        },
        {
            "text": " "
        },
        {
            "text": "We want every child who needs one to have a great social worker. They can change the lives of children for the better. "
        },
        {
            "text": " "
        },
        {
            "text": "To make that happen, we need to support them more and they need to know how valued they are. "
        },
        {
            "text": " "
        },
        {
            "text": "We plan to increase the number of people becoming social workers and give existing social workers more and better training. We want to recruit 500 new child and family social worker apprentices and we are introducing a framework to support social workers early in their career."
        },
        {
            "text": " "
        },
        {
            "text": "We also want to reduce the amount of office work social workers do so they can spend more time with children and families and help social workers stay working at the same place for longer - this will mean children don’t have to tell their life stories lots of times. "
        },
        {
            "text": " "
        },
        {
            "text": " "
        }
    ]
}