{
    "url": "https://ruralpayments.blog.gov.uk/2023/02/02/key-dates-to-look-out-for-in-2023/",
    "title": "Key dates to look out for in 2023",
    "authors": [
        "RPA Editor"
    ],
    "categories": [
        "Basic Payment Scheme",
        "Countryside Stewardship",
        "Environmental Stewardship"
    ],
    "pub_date": "2023-02-02T15:42:35+00:00",
    "content": [
        {
            "text": "We are sharing the key dates to look out for in 2023 for the Basic Payment Scheme (BPS), Countryside Stewardship (CS), Environmental Stewardship (ES) and the Lump Sum Exit Scheme so you can now check when you can make your applications and claims."
        },
        {
            "text": "We know it’s important you have a full picture of what funding is available when, so key dates for the Sustainable Farming Incentive (SFI) and our Grants will be added shortly."
        },
        {
            "text": "Last week Defra published an environmental land management scheme update including the full range of actions, payment rates and when they’ll be available, with a summary on the Future Farming blog. Additionally, guidance for every scheme and grant on offer can be found on the Funding for farmers and land managers page on GOV.UK."
        },
        {
            "text": "2023 Applications"
        },
        {
            "text": "We’ve listened to feedback on what worked well on the SFI pilot and SFI 2022, particularly the straightforward application process, and wanted to see where we could introduce some of this into our other services."
        },
        {
            "text": "While CS Higher Tier will continue to use the established application process, CS Mid Tier will look different. So to make sure we have everything in place we are moving the CS Mid Tier window this year to slightly later in the spring. The window will remain open for the same length of time so anyone that wants to apply should have plenty of time to do so. We are excited about the changes and believe that it will makes things even more straightforward for farmers to apply."
        },
        {
            "text": "In the meantime, to get ready for CS Mid Tier, you can check that your land is correct by signing into the Rural Payments Service and making any changes now, so you are ready to apply once the window opens."
        },
        {
            "text": "2023 Claims"
        },
        {
            "text": "We’d like to remind all existing CS and ES agreement holders, including those in their first year of the scheme that after signing up to a revenue agreement, you will also need to claim to be paid for any revenue options. Unlike BPS where making an eligible application generates a payment, for CS the application/agreement and the claim are two separate actions. For ES, if you are offered and accept an extension to your agreement, you will still need to submit a claim for 2023."
        },
        {
            "text": "Reminders to claim will continue to be shared throughout the claim window. This year we have also extended the period in which you can still submit a CS or ES claim, with a reduction, after the closing date of 15 May. This will give farmers more opportunity to receive some payment if they miss the claim deadline, but we would urge anyone with an agreement to get their claim in to us by 15 May."
        },
        {
            "text": "Transfer land parcels and BPS entitlements"
        },
        {
            "text": "Further dates that you may find useful; you can transfer land and BPS entitlements using the Rural Payments service until 15 May 2023."
        },
        {
            "text": "You can also add land by email to your BPS, CS, or SFI application. If you are applying for BPS, you’ll need to email by 2 May 2023 to make sure the change is made in time for your 2023 application. For CS agreements we will continue to work on requests to add land after 15 May. You can read the guidance for this on GOV.UK."
        }
    ]
}