{
    "url": "https://despatch.blog.gov.uk/2023/02/02/loveday-ryder-our-plans-for-2023/",
    "title": "Loveday Ryder: Our plans for 2023",
    "authors": [
        "Loveday Ryder"
    ],
    "categories": [
        "Driving instructors",
        "Driving test",
        "Ready to Pass?"
    ],
    "pub_date": "2023-02-02T14:17:39+00:00",
    "content": [
        {
            "text": "In this blog post, I want to update you on what’s coming up 2023 including continuing our work in bringing driving test waiting times down, the launch of our brand-new campaign website, investing in our people and new technologies, and more."
        },
        {
            "text": "2022 was difficult for many of us and we know that driving test waiting times are affecting ability to take on new on new customers. We have been working with NASP closely to listen to your views, and we’ll continue to do this."
        },
        {
            "text": "Continuing our work to reduce waiting times  "
        },
        {
            "text": "Much of our work will still be focussed on bringing test waiting times down to 9 weeks. Although we made significant progress last year, there is still much work to be done. There are many projects and activities that are all contributing to this."
        },
        {
            "text": "We will continue to keep you up-to-date on news and developments through our usual channels."
        },
        {
            "text": "Look out for our Ready to Pass?’ new and improved campaign site"
        },
        {
            "text": "Keep a look out for our new multi-page ‘Ready to Pass?’ campaign website which we’ll be launching in February. The new site’s better functionality will make it easier for you to find and access resources that will help you and provide bespoke content spaces for each of our audiences."
        },
        {
            "text": "We will also be running a trial to boost our campaign communications by working with an external media agency. This is so that our messages can be seen more often and in more places by learner drivers and help encourage them to check that they are completely ready before taking their test."
        },
        {
            "text": "Transforming the driver services delivery model "
        },
        {
            "text": " We’re creating a modern, flexible driver testing service that will look at different ways to deliver driving tests. This will allow us to see whether we can be less dependent on a fixed estate and react where the road and traffic conditions near a centre have evolved and no longer provide the best environment in which to assess a candidate's ability to drive."
        },
        {
            "text": "We recently began trials at two driving test centres Doncaster and Birmingham (Kings Heath) to see whether there is potential for the practical test to be less dependent on fixed estate and building on current and future technologies."
        },
        {
            "text": "A new approach to training"
        },
        {
            "text": "We’re supporting training organisations to carry out effective manoeuvres tests and reintroduce training for new delegated vocational examiners for resilience and flexibility. We'll also explore conducting driving tests from locations other than our driving test centres. We want to explore the benefits to you and your pupils of having more flexible options of where candidates can sit their tests."
        },
        {
            "text": "Changes to the assessment process for ORDIT"
        },
        {
            "text": "We will be increasing the number of examiners who can do ORDIT assessments for both new applicants and current members whose registrations have lapsed."
        },
        {
            "text": "We will also be updating the assessment process to continue work to raise professional standards and ensure learner drivers (and instructors) have access to the highest quality tuition possible."
        },
        {
            "text": "How electric and autonomous vehicles can affect our industry"
        },
        {
            "text": "Another area we’ll continue to look at is how electric and autonomous vehicles impact on the instruction delivered by ADIs and if our tests need to be updated to reflect any changes in autonomous vehicle technology."
        },
        {
            "text": "Improving access to your performance reports"
        },
        {
            "text": "We will be working with the Government Digital Service to explore an accessible online form to improve the way you can request your performance reports."
        },
        {
            "text": "We have lots to accomplish this year and I’m looking forward to another busy year working with you to improve our service and promote a lifetime of safe driving."
        }
    ]
}