{
    "url": "https://childrenssocialcare.blog.gov.uk/2023/02/02/making-sure-children-and-young-peoples-voices-are-heard/",
    "title": "Making sure children and young people's voices are heard",
    "authors": [
        "Anne-Marie Connelly"
    ],
    "categories": [
        "Independent Review of Children's Social Care",
        "Uncategorized"
    ],
    "pub_date": "2023-02-02T14:49:11+00:00",
    "content": [
        {
            "text": "Anne-Marie Connelly, is a member of the Children's Social Care National Implementation Board, which brings together strategic leaders and people with lived experience of the care system to advise on the government's reform strategy for children’s social care. Here, she tells us about how important it is for children and young people's voice to be heard to help shape reforms. "
        },
        {
            "text": "When I agreed to be part of the National Implementation Board (NIB) in October, I knew I wanted to use my voice to advocate for the needs of care experienced people everywhere, but I also knew my voice alone wouldn’t truly represent the huge range of experiences people have of the system."
        },
        {
            "text": "On the day the Children's Social Care Implementation Strategy is published, I wanted to make sure that children and young people everywhere knew that I had made the case for their voices to be heard in the next stage, and I thought this blog was the best way to do that."
        },
        {
            "text": "The first thing I said to the Department for Education (DfE) when I joined the NIB was that we needed to set up a proper advisory board, made up of children and young people, to help shape the reform programme and have their voices heard at the very highest level. In fact, I said I wouldn’t be on the NIB if we couldn’t make this happen, it’s that important to me."
        },
        {
            "text": "I’m pleased to be able to say that we will be setting up this board in March with more information to follow in February. The board will be made up of young people from across England who have had different experiences of the system. From children’s homes to foster care, from the good experiences to the horrific, I want this board to be a place where honest stories are heard and respected."
        },
        {
            "text": "I haven’t been part of the NIB for long, and when I joined, I knew that I only had a few months to try and influence the strategy before it was published as most of it was written prior to me joining."
        },
        {
            "text": "I have been able to read the strategy and tell the DfE what I think about it. I am glad that the strategy has started to explore corporate parenting and the other types of departments, agencies and organisations that should be involved in this duty and play a role in giving children in care the same love and support as any other child. I am happy that this strategy talks about the need for lifelong loving relationships. As an apprentice myself, I am also glad that I’ve been able to advocate for the apprenticeship bursary to be increased to help make sure that more children and young people can access opportunities. None of these areas are perfect but hopefully with a board of more than one voice, we will be able to create some meaningful differences for children in care, and care leavers."
        },
        {
            "text": "However, with that said, there are also things the Strategy doesn’t go far enough on that are very important to me but also the children and families I speak to and represent. I would have liked to have seen a consultation on protected characteristics as many people are misinformed about the importance of this and how much of a difference it could make."
        },
        {
            "text": "I know some people are worried that making care experience a protected characteristic would increase stigma for care leavers. I think this is untrue. No one ever has to identify themselves as having a protected characteristic, but if you do, you are afforded protections that make it harder for people to use it against you."
        },
        {
            "text": "I want to work with the government to go further on protection for care leavers as the strategy is delivered and so I will still be there, as part of the NIB, to challenge and push the government forward on this."
        },
        {
            "text": "I also want everyone who reads this to know that the advisory board is not the only way you can tell the government what you think. From today, you can respond to the consultation on the strategy. I think this is an important way to have your say. There are questions designed specifically for children and young people, although you can answer as much or as little as you like of the whole consultation. You can also explain to government what you would do if you were in charge and explain what else you think needs to happen to properly transform the lives of children in care."
        },
        {
            "text": "So, at this incredibly important moment I want other children and young people, and people who like me have experienced the care system, to join me in calling for the things we know are needed and right."
        },
        {
            "heading": 4,
            "text": "The Children’s Social Care Implementation Strategy and consultation, Stable Homes Built on Love, sets out how the government is strengthening support for care leavers and kinship care. "
        },
        {
            "heading": 4,
            "text": "Read the strategy and respond to the consultation on children’s social care on gov.uk. "
        }
    ]
}