{
    "url": "https://earlyyears.blog.gov.uk/2023/02/02/ofsteds-2023-priorities-for-early-years/",
    "title": "Ofsted's 2023 priorities for early years",
    "authors": [
        "Lee Owston, Acting National Director Education",
        "Yvette Stanley, National Director Regulation and Social Care"
    ],
    "categories": [
        "Childminder registration",
        "Early years",
        "Nannies"
    ],
    "pub_date": "2023-02-02T15:49:47+00:00",
    "content": [
        {
            "text": "Before looking ahead to what 2023 will hold for the early years sector, it's worth reflecting on the year that has just passed."
        },
        {
            "text": "Ofsted ended the year with the publication of our Annual Report, which provides an overview of what our inspections found, our research, and identifies important themes and potential challenges. You can read the full report here and the early years section here."
        },
        {
            "text": "What we saw in 2022"
        },
        {
            "text": "We are particularly aware of the long-term difficulties nurseries, pre-schools and childminders are facing at the moment."
        },
        {
            "text": "We know that many nurseries and preschools are having problems in recruiting and retaining high-quality staff, alongside more childminders leaving the sector. This may be caused, and is certainly compounded, by changes in parental preference, working patterns, and childcare requirements as well as cost of living pressures. A part of the solution to the recruitment difficulties might be through apprentices but unfortunately fewer young people are even beginning these programmes. The number of people them fell from just over 27,000 six years ago, to just over 16,000 last year."
        },
        {
            "text": "Alongside this difficult working situation, helping young children catch up after the pandemic is an unprecedented challenge."
        },
        {
            "text": "The report identified the longer-term impacts of the pandemic. It is now clearer where children have fallen behind, and the difficulties the sector faces in helping them to catch up. But we did see some great examples of providers doing just that."
        },
        {
            "text": "These included:"
        },
        {
            "text": "Fortunately, these problems have not affected the profile of inspection judgements so far, but they are something we're very aware of as we move in to 2023. However, for now, 97% of childminders and 96% of nurseries and pre-schools are rated good or outstanding – a very impressive feat considering the circumstances."
        },
        {
            "text": "Our focus"
        },
        {
            "text": "The report, along with our research review Best Start in Life, emphasised the importance of curriculum in the early years."
        },
        {
            "text": "We’ve committed to a strategic priority of giving children ‘the best start in life’, and high-quality early years education is vital to that. Children attend nurseries, pre-schools and childminders at a crucial developmental point in their lives. What they learn during this time forms the foundation for their future educational attainment, as well as their future health and happiness."
        },
        {
            "text": "Making sure children achieve their potential at this stage is therefore of the upmost importance."
        },
        {
            "text": "Of course, preparing children for future study is not the only purpose of early years education, but it is an important one. Our research review identified some of the features that high-quality early years curriculum and pedagogy may have, and we would encourage all providers to consider this in their work this year."
        },
        {
            "text": "The work we are doing in this area is guided by another of our strategic priorities, our commitment to ‘right touch regulation.’ We want to help practitioners to make sure children get all they can from their early years. We’re working where we can to streamline what we require from providers to allow them to spend more time with the children in their care."
        },
        {
            "text": "What will 2023 hold?"
        },
        {
            "text": "In 2023, we will be publishing further parts of our research review for the early years. Subsequent reviews will explore the 7 areas of learning in the Early Years Foundation Stage, taking into account that the areas of learning are all interconnected."
        },
        {
            "text": "We will continue our focus on communication and language. As we reported in the first part of our early years research review, if children do not develop and learn these abilities in their early years, it has a lasting impact on their educational progress. It underpins all future learning, and we will continue to emphasise its importance."
        },
        {
            "text": "As we have said above, high-quality apprenticeships can be part of the solution to recruitment difficulties. We’re awaiting the results of the consultation on updating and improving the Level 3 criteria for Early Years Educators. These criteria need to capture the right things and be brought up to date. We hope this update process can be completed quickly."
        },
        {
            "text": "We are also working to improve the efficiency of our registration process. We’ve already published a blog on our efforts to streamline the process here and will always seek to make things easier where we can, in line with our ‘right touch regulation’ strategic priority."
        }
    ]
}