{
    "url": "https://ofsi.blog.gov.uk/2023/02/02/oil-price-cap-update-refined-products/",
    "title": "Oil Price Cap Update: Refined Products",
    "authors": [
        "OFSI"
    ],
    "categories": [
        "Oil Price Cap"
    ],
    "pub_date": "2023-02-02T15:17:16+00:00",
    "content": [
        {
            "text": "The UK and our allies have introduced some of the broadest and most severe sanctions against Russia that any country has ever faced. In alignment with our coalition partners, we have banned the import of Russian oil and oil products into our markets, and we have further banned UK services including finance, insurance, and shipping from enabling the maritime transport of Russian crude oil globally, unless the oil is sold at or below the price cap. This prohibition came into force on 5 December 2022 with the accompanying Russian crude oil price cap."
        },
        {
            "text": "Initial signs suggest that the crude oil cap is successfully curtailing Putin’s ability to use revenues from oil sales to finance his illegal war, while minimising disruption to global supply, with the discount between Russia’s flagship crude oil grade and global benchmarks increasing by over 50% since November to around $40."
        },
        {
            "text": "The prohibition on UK ships and services involved in the maritime transportation of Russian oil came into force on 5 December 2022 with the intention to extend this prohibition to Russian oil products on 5 February 2023. The oil price caps for refined products, implemented by a General Licence, will accompany this ‘services ban’ to enable the maritime services sector to continue to transport affordable oil to third countries that need it. As there are different refined oil products with different production costs, sale values, and volumes, we intend to categorise the oil products we are targeting with this measure. In line with our coalition partners, we believe this approach best achieves our objectives of placing direct downward pressure on Russian oil revenues, whilst also being simplest to implement, and most workable for industry. We are working closely with coalition partners to ensure consistency and clarity on which oil products are captured by this measure, and full guidance will be published for 5 February."
        },
        {
            "text": "To ensure market participants are able to transition to these new sanctions OFSI will introduce a new winddown period, similar to that for crude oil which ran until 19 January. This will mean refined oil products loaded onto vessels before 5:01am GMT on 5 February and offloaded before 5:01am GMT on 1 April are not subject to the oil price cap for refined products. This will be implemented by a General Licence to be published for 5 February."
        },
        {
            "text": "Firms can comply with the maritime services ban by ensuring they are not involved in transactions which relate to the shipping of Russian oil that is in breach of the cap price. To comply with the price cap, industry will be required to abide by the relevant part of a 3-tier attestation model and the recordkeeping and reporting requirements listed in the updated guidance and General Licences which will be available on our website. Industry must ensure they meet these requirements once the Russian oil products cap comes into effect on 5 February 2023."
        },
        {
            "text": "For any queries around the implementation of the Russian oil products cap, please get in touch with OFSI at oilpricecap.ofsi@hmtreasury.gov.uk"
        }
    ]
}