{
    "url": "https://cspl.blog.gov.uk/2023/02/02/public-sector-leaders-need-to-keep-talking-about-standards/",
    "title": "Public sector leaders need to keep talking about standards",
    "authors": [
        "Lord Jonathan Evans"
    ],
    "categories": [
        "Leadership",
        "Leading in Practice"
    ],
    "pub_date": "2023-02-02T12:40:59+00:00",
    "content": [
        {
            "text": "How do you personally demonstrate and encourage others to live up to the Nolan Principles? What are you doing to support people to make the right decisions when faced with ethical risks and challenges? Does your organisation have trusted ways for people to raise their concerns when things \"just don’t feel right\"? These are just some questions posed by my committee today to public sector leaders and those delivering public services across the UK."
        },
        {
            "text": "Our new report, Leading in Practice, contains evidence and case studies from a range of organisations - in the private, charitable and public sectors – on how they try to set and embed a culture of high standards."
        },
        {
            "text": "One of the seven Principles of Public Life, leadership was seen by Lord Nolan as an overarching principle, critical to the other six – honesty, integrity, openness, selflessness, objectivity and accountability.  Sticking to these principles is a personal responsibility for anyone working in the public sector or employed by a company delivering public services on behalf of the taxpayer. But people don’t operate in a vacuum; organisations can hinder or facilitate ethical behaviour, which is why organisational culture is so important."
        },
        {
            "text": "To some, this may seem like soft stuff coming from a standards body but the evidence we received from business and public sector leaders said having shared values and helping staff live up to them is critical to the success of every organisation. An approach which focuses only on compliance is a missed opportunity. While rules and codes are important, leaders also have the opportunity to galvanise and empower the people in their organisations to aim high, tapping into public service ethos that attracts many to a career in the public sector. Standards matter – to the quality and fairness of decision making, to business success, to stable government and to our country’s reputation internationally. We heard how a values-driven culture aids organisational risk management, attracts the highest-calibre workers and supports the delivery of public services – and that good practice can be implemented without a large budget."
        },
        {
            "text": "Our report shares examples of how different organisations have sought to build ethical values into their policies, practices and ways of working. In some cases, this came about following a crisis and in others, a realisation that new systems and processes were needed to support their employees. We share them, not as a ‘gold standard’ to reach but as a source of ideas and inspiration."
        },
        {
            "text": "Our research and conversations with leaders threw up some common themes across the range of organisations: the importance of leaders exhibiting high standards in their own behaviour and showing they are listening to and acting on concerns; that organisations require a proactive approach to ethics through induction, regular training and discussion, and the importance of good governance and policies on recruitment and performance management that have ethical values at their core."
        },
        {
            "text": "Rules and structures alone are insufficient. They need to be underpinned by an organisational culture that values high standards and helps people face the right way when it comes to ethical issues.  A shared understanding of ethical values won’t simply happen by accident or osmosis. Our evidence shows that it takes diligence, vigilance and sometimes a great deal of moral courage."
        },
        {
            "text": "Of course, leadership in the public sector can be especially complex. Large projects, serving diverse populations, stewardship of public money and interaction with local and national political imperatives can make for uniquely tricky decision making and conflicting priorities – which is why the common values set out in the Nolan Principles are so important. They set out what the public expect of those who serve them."
        },
        {
            "text": "There is no one size fits all solution; context is important and building an ethical organisational culture requires consistent effort and discussion. But at a time when the public sector is facing huge challenges, change and disruption, this is not a ball that can be put down or dropped. I want our report to prompt reflection, discussion and action."
        },
        {
            "text": "First published in Civil Service World on 24 January 2023."
        }
    ]
}