{
    "url": "https://despatch.blog.gov.uk/2023/02/02/reflecting-on-dvsas-successes-in-2022/",
    "title": "Reflecting on DVSA’s successes in 2022",
    "authors": [
        "Loveday Ryder"
    ],
    "categories": [
        "Driving instructors",
        "Feature"
    ],
    "pub_date": "2023-02-02T13:56:28+00:00",
    "content": [
        {
            "text": "I want to take you back to 2021, when we were facing arguably the most difficult challenge in DVSA history that had such a substantial impact on our own work and home lives. Restrictions were still in place which limited the number of tests that we could carry out, face coverings were mandatory, you were unable to sit in on your pupils’ tests, and we had to stop tests early if the candidate made a serious or dangerous fault."
        },
        {
            "text": "When restrictions lifted, we were all delighted that we could return to “normal” and I was proud to see how quickly we adapted to each new challenge and the progress that we made towards entering 2022 on a positive note."
        },
        {
            "text": "In this blog post, I want to look back at all our achievements in 2022 including bringing driving test waiting times down, tackling businesses exploiting learner drivers, and the launch of our ‘Ready to Pass?’ campaign."
        },
        {
            "heading": 3,
            "text": " Reducing driving test waiting times"
        },
        {
            "text": "As you know, much of our focus has been on reducing driving test waiting times. Through implementing several measures, we managed to:"
        },
        {
            "text": "Our latest statistics show that the pass rate (December 2022) is now at 48.8% which is 2.8% higher than in pre-pandemic 2019, when it was 46%. This is only possible when you bring learners who are ready for their test. The increase in the pass rate means an increase in the number of driving tests which are available."
        },
        {
            "text": "We know we still have more work to do, so reducing driving test waiting times will continue to be our main priority in 2023."
        },
        {
            "heading": 3,
            "text": " Responding to Industrial action and bad weather"
        },
        {
            "text": " Despite the challenges we have faced given the high demand for tests, impact of bad weather and industrial action, we have minimised as much as we can the impact on you and your pupils."
        },
        {
            "text": "You also made sure that your pupils knew what action to take and followed the correct guidance if their test had been affected. This allowed us to rearrange tests quickly, and we will continue to process any out-of-pocket expense claims as quickly as possible.  "
        },
        {
            "heading": 3,
            "text": "Recruiting more driving examiners"
        },
        {
            "text": "Our campaign to recruit more driving examiners has continued to be a success. Since January 2022, we have hired 182 new examiners who are fully qualified and in test centres around the country. We also have a further 117 people who are currently qualifying that we hope to get into test centres soon."
        },
        {
            "text": "As a result of our recruitment campaign, which was initially launched in April 2021, we have created an estimated 300,000 extra appointments."
        },
        {
            "heading": 3,
            "text": "Tackling businesses exploiting learner drivers"
        },
        {
            "text": " Last year, in a survey, 41.8% of you said your customers’ tests were being moved on the online business service by unofficial companies."
        },
        {
            "text": "We introduced measures to tackle this, including:"
        },
        {
            "text": "We plan to work closely with you to help educate learners about what they need to know and understand about booking their test through unofficial booking sites. We want to educate learners about how their data is being used and being charged an admin fee when not booking through our official booking service."
        },
        {
            "text": "After we introduced these measures, we found the number of learners not attending their tests fell from 4.66% in April to June in comparison to 3.41% between July and December. This meant that an extra 10,426 tests to go ahead in this time. Given the high waiting times we want to do everything we can to make every test count."
        },
        {
            "heading": 3,
            "text": "Reducing the number of wasted driving tests"
        },
        {
            "text": " To help us reduce the number of wasted tests caused by learners not turning up, we introduced a new text message reminder service in July to remind customers they had a test coming up. Introducing our reminder service also contributed to the extra tests that went ahead between July and December."
        },
        {
            "text": "We appreciate you encouraging your pupils to add their telephone number when booking their driving test to enable them to receive our text message reminders."
        },
        {
            "heading": 3,
            "text": " Launching the Ready to Pass? campaign"
        },
        {
            "text": "One of the other challenges we’ve faced is that many learner drivers are taking their test before they are ready. As result more than half of them are having to book and retake their test again and are adding to the number of learners waiting for a test."
        },
        {
            "text": "To help address this, we launched the ‘Ready to Pass?’ campaign in July."
        },
        {
            "text": "Since we launched the campaign:"
        },
        {
            "heading": 3,
            "text": "Responding to your queries"
        },
        {
            "text": "The pandemic left us with a build-up of queries that meant our usual waiting times were longer at the start of the year."
        },
        {
            "text": "We’ve improved service levels by recruiting 49 extra customer service call agents. Colleagues have been working overtime to bring email waiting times down."
        },
        {
            "text": "We’re proud that our call waiting times have dropped and now 75% are answered in under 2 minutes. This would not have been possible without those of you who have used our online services such as the book and manage your pupils test service, to help us bring our call waiting times down."
        },
        {
            "text": "Emails relating to theory tests are down to 3-day response times, and those about practical tests now take 4 days."
        },
        {
            "heading": 3,
            "text": "Resources and open days to support you, your pupils, and their families  "
        },
        {
            "text": "We know how much it means to your pupils to pass their test and gain the freedom and independence having a driving licence offers them. This means you are often under a lot of pressure from your pupils and their families to take them before they are ready."
        },
        {
            "text": "To help with this, in June we published guidance to help you carry out realistic mock tests which we know is a way that you can show a learner or a parent that they are not quite ready to take the test. This has been viewed 33,000 times and users of the guide has rated its usefulness %."
        },
        {
            "text": "In November, we also published guidance to support people who are supervising learner drivers with private practice to help make sure they are doing this correctly and it complements the training you give to your pupils. So far, it's been viewed over 15,000 times."
        },
        {
            "text": "Thank you to those of you who have promoted both guidances and shared them."
        },
        {
            "text": "Also, 13 of our test centres have opened their doors to hold open days for you, your pupils and the people supporting their learning to drive journey to meet examiners and find out more about the driving test."
        },
        {
            "text": "Over 2,700 people have attended and of those who did:"
        },
        {
            "heading": 3,
            "text": "Driving test: accessibility and process consultation"
        },
        {
            "text": " In January 2022, we held a consultation on changing some policies that affect learning to drive and driving tests. The consultation received over 21,000 responses.  I’d like to thank everyone who filled out the consultation to share your feedback with us."
        },
        {
            "text": "We have been working behind the scenes to analyse the data, and the results of the consultation will be published soon. "
        },
        {
            "heading": 3,
            "text": "Developing a new driving test booking service"
        },
        {
            "text": "We’ve been looking to the future and making plans to replace our driving test booking system. Last year, we carried out some research into the booking system to help us understand what you and your pupils need, what constraints we face, and what opportunities there are to improve things. We began work building and testing some working prototypes and trialling different ideas."
        },
        {
            "text": "We will carry on this work in 2023 by developing the system and testing it with our customers."
        },
        {
            "text": "Thank you for taking the time to help us with our research. This will help us to achieve our goal of providing great services - whether they’re learner drivers, driving instructors, training schools or our own colleagues."
        },
        {
            "heading": 3,
            "text": "Providing support to ADIs "
        },
        {
            "text": "In the summer, our ADI examiners team reached a key milestone of over 2,500 driving instructors taking the option of an engagement call before their standards check. This has now reached over 3,500 calls. To identify those who need our support, we prioritise them through the Test Information Programme which also means we no longer build backlogs."
        },
        {
            "text": "The feedback we have received from you have said the engagement calls have helped you understand areas of your work that could be better and have valued the advice given to help make improvements."
        },
        {
            "heading": 3,
            "text": "Helping communicate the changes to The Highway Code"
        },
        {
            "text": "The rules for all types of road users in The Highway Code were updated to improve the safety of people walking, cycling, and riding horses. We appreciate how quickly you adapted and incorporated the new rules into your teaching and helping learners to better interact with vulnerable road users."
        },
        {
            "text": "We are proud to have played an important role in supporting the Department for Transport in helping to communicate these changes and making the updated Highway Code available and accessible to road users."
        },
        {
            "text": "In December 2022, we published The Highway Code in Welsh for the first time on GOV.UK, with the new printed edition in Welsh being launched in 2023."
        },
        {
            "heading": 3,
            "text": "Looking forward "
        },
        {
            "text": "2023 is set to be another exciting year for us. I have written another blog that outlines our plans for the upcoming year and you can read this on GOV.UK."
        },
        {
            "text": " We are looking forward to working with you on many initiatives to deliver the best possible outcomes. I want to thank you for your continued commitment and effort. Every one of us has an important role to play in the work ahead and I’m confident that together we will achieve our goals."
        }
    ]
}