{
    "url": "https://nationalscreening.blog.gov.uk/2023/02/02/uk-nsc-recommends-introduction-of-screening-for-tyrosinaemia-in-newborns/",
    "title": "UK NSC recommends introduction of screening for tyrosinaemia in newborns",
    "authors": [
        "Mike Harris"
    ],
    "categories": [
        "General"
    ],
    "pub_date": "2023-02-02T09:02:22+00:00",
    "content": [
        {
            "text": "The UK National Screening Committee (UK NSC) is recommending the introduction of screening for tyrosinaemia as part of the newborn blood spot screening programme in the 4 UK nations."
        },
        {
            "text": "The committee agreed to make this recommendation at its most recent meeting."
        },
        {
            "text": "Tyrosinaemia type 1, or TYR1, is a very rare genetic condition that prevents the body breaking down a substance called tyrosine found in food. If untreated, tyrosine gathers in the body and can damage the liver, kidneys and the nervous system."
        },
        {
            "text": "The UK NSC delayed making a recommendation on TYR1 in June 2022 to allow more time for work to assess whether a screening programme could be cost effective."
        },
        {
            "text": "The findings of this additional modelling work were presented to the committee in November. The modelling suggested screening could increase the number of babies with TYR1 who are detected before the onset of symptoms. These babies could then be offered drug treatment and a special diet, avoiding liver disease and the need for liver transplantation."
        },
        {
            "text": "UK NSC chair Prof Sir Mike Richards said:"
        },
        {
            "text": "The responses received in the consultation helped identify papers which informed the additional modelling work. The committee would like to thank stakeholders for contributing in this way."
        },
        {
            "text": "There is always uncertainty with rare diseases and modelling work aims to support the UK NSC to make the best decisions in conditions with very little evidence. The committee therefore stressed the importance of collecting and reporting data on screening and babies’ health over time to assess the real world impact of screening for TYR1."
        },
        {
            "heading": 2,
            "text": "More work needed to assess screening for pre-eclampsia "
        },
        {
            "text": "The committee also called for more work to evaluate the case for screening for pre-eclampsia (PE)."
        },
        {
            "text": "PE affects women, usually in the second half of pregnancy (from 20 weeks), during labour or in the first few days after birth. Symptoms are high blood pressure (hypertension) and too much protein in the urine (proteinuria). Left untreated, PE can cause serious, even fatal, complications for both mother and baby."
        },
        {
            "text": "Women with the most severe form of the condition, preterm PE, need their babies to be born before 37 weeks of pregnancy to prevent possible harm to themselves and their babies."
        },
        {
            "text": "The UK NSC had previously found there was not enough evidence to recommended screening for PE."
        },
        {
            "text": "A summary of new evidence, commissioned by the UK NSC in 2022, suggested there could be a safe and suitable population screening test and intervention, but for preterm PE only. It found that a daily dose of 150mg aspirin up to 36 weeks’ gestation might:"
        },
        {
            "text": "The committee reiterated its recommendation not to introduce population screening for pre-eclampsia but agreed that it should explore the potential for screening for preterm PE only."
        },
        {
            "text": "As a first step, it asked the evidence team to explore what types of additional work should be pursued with key stakeholders."
        },
        {
            "heading": 2,
            "text": "Committee recommends archiving of 3 other topics"
        },
        {
            "text": "The UK NSC considered 3 other fetal, maternal and child health (FMCH) topics at its November meeting – autism spectrum disorder in children under 5, iron deficiency anaemia in children and universal antenatal screening for human T-lymphotropic virus type 1 (HTLV1)."
        },
        {
            "text": "It recommended that all 3 should be archived as population screening topics due to a lack of new evidence and the number of times they had previously been reviewed. However, the committee noted that it could consider a future targeted screening proposal for HTLV1."
        },
        {
            "text": "Following approval from the UK NSC’s FMCH expert group, all 3 topics will be archived and removed from the list of conditions the committee regularly reviews. If new evidence becomes available, anyone would still be able to submit an annual call proposal for the UK NSC to consider these topics again."
        },
        {
            "heading": 2,
            "text": "Keep up to date"
        },
        {
            "text": "The UK NSC blog provides up to date news from the UK National Screening Committee. You can register to receive updates direct to your inbox, so there’s no need to keep checking for new articles. If you have any questions about this blog article, or about the work of the UK NSC, email screeninginformation@dhsc.gov.uk."
        }
    ]
}