{
    "url": "https://defrafarming.blog.gov.uk/2026/02/09/a-survey-for-the-tenant-farming-sector/",
    "title": "A survey for the tenant farming sector",
    "authors": [
        "Alan Laidlaw"
    ],
    "categories": [
        "Guest post",
        "Tenant Farming Sector"
    ],
    "pub_date": "2026-02-09T11:04:46+00:00",
    "content": [
        {
            "text": "As the Commissioner for the Tenant Farming Sector, my role is to be a trusted, impartial and confidential point of contact for anyone in the sector who wants to raise concerns about unreasonable behaviour related to the Agricultural Landlord and Tenant Code of Practice for England.  "
        },
        {
            "text": "My aim is to help encourage fair treatment and positive relationships across the tenant farming sector. "
        },
        {
            "text": "To help with this, my team and I are launching a short survey. We want to understand how familiar people are with the remit of my role and the code of practice. "
        },
        {
            "text": "Whether you’re a tenant farmer, landlord, agent, or adviser, we want to hear from you. "
        },
        {
            "text": "By completing the survey, you will help us build a clearer picture of the views, experiences and needs across the sector. "
        },
        {
            "text": "Your responses will also help shape our future priorities and engagement, so we can focus our work where it will have the greatest impact in maintaining and improving behaviour across the sector. "
        },
        {
            "text": "Completing the survey takes around 10 minutes and will help ensure the tenant farming voice is fully represented. "
        },
        {
            "text": "We’d really appreciate your response, and if you’re able, please share the link with others in the sector too.  "
        },
        {
            "heading": 2,
            "text": "Share your views"
        },
        {
            "text": "The survey closes on 6 March 2026. "
        },
        {
            "heading": 2,
            "text": "Visits and conversations"
        },
        {
            "text": "Regularly meeting and talking with tenants, landlords, agents and other stakeholders is central to my role. "
        },
        {
            "text": "By being an impartial and accessible point of contact, my aim is to stay close to what is happening across the sector, spot issues early, encourage positive change, and celebrate good practice before problems escalate. "
        },
        {
            "text": "Over the past few months, my team and I have been meeting people across the farming tenancy sector and have travelled widely across England, from the south-west to the north-east.  "
        },
        {
            "text": "Last week, I met with tenant farmers in Cumbria, kindly supported by the Farmer Network and the Tenant Farmers Association. Listening directly to tenants and hearing about day-to-day experiences is incredibly valuable. "
        },
        {
            "text": "It helps me build a clear and balanced understanding of the issues and means I can represent those views effectively in the Farm Tenancy Forum and in discussions with Defra policy colleagues. "
        },
        {
            "text": "That visit was followed by time in the Duddon Valley with Paddy Deady, Mark Hodgson, and their families to learn more about their Landscape Recovery project, supported by Defra funding. This post shares more detail. It was a great example of partnership working in action and the difference it can make for farms, the environment and the people involved.  "
        },
        {
            "text": "Tenancies in the uplands are a particular focus. Circumstances vary widely, so I want to stay close to what is happening on the ground, understand what is working well, and use those lessons to help in places where relationships and outcomes remain challenging and, at times, sensitive."
        },
        {
            "text": "This sits alongside wider work to support those in upland communities, including research led by Dr Hilary Cottam to inform a place-based approach, highlighted recently by the Secretary of State.  "
        },
        {
            "text": "I welcome the opportunity to meet anyone involved in the tenant farming sector, whether to hear about your situation or to raise awareness of the support my office can offer. "
        },
        {
            "text": "I would also be grateful for suggestions and signposting to events, networks or other opportunities that can help strengthen our visibility and deepen our understanding of the sector.  "
        },
        {
            "text": "If you would like to read more about my role and remit, you can find information on GOV.UK: Commissioner for the Tenant Farming Sector: role and services. "
        },
        {
            "text": "If you would like to get in touch, please email CTFS@defra.gov.uk "
        },
        {
            "text": "I look forward to going through the survey results, and to continuing to meet people across the sector and share updates from my work. "
        }
    ]
}