{
    "url": "https://dvsadigital.blog.gov.uk/2026/02/09/dvsas-digital-year-in-review-building-better-services/",
    "title": "DVSA’s digital year in review: building better services ",
    "authors": [
        "Becky Thomas"
    ],
    "categories": [
        "Accessibility",
        "Data",
        "Digital engagement",
        "Service design",
        "Strategy",
        "Technology"
    ],
    "pub_date": "2026-02-09T14:03:04+00:00",
    "content": [
        {
            "text": "As I reflect on the past 12 months at DVSA, I'm incredibly proud of what we've achieved together as an agency.   "
        },
        {
            "text": " Our digital transformation has moved forward considerably this year, touching every corner of our work – from the services we deliver, to the systems our colleagues use every day "
        },
        {
            "text": "None of this progress would have been possible without the dedication and expertise demonstrated by all our teams across the organisation.   "
        },
        {
            "heading": 2,
            "text": "Delivering accessible services for all    "
        },
        {
            "text": "DVSA has set a new benchmark for accessibility by launching the UK Government’s first British Sign Language (BSL) service for booking a theory test. Developed in collaboration with Government Digital Service (GDS), Kainos, and Signly, this innovation addressed the challenges faced by BSL users when booking and preparing for the theory test, which had contributed to lower pass rates.  "
        },
        {
            "text": "The service uses Signly technology to translate written English into BSL videos, bridging the gap between text and signed communication. Delivered in just 5 months, this marks a historic first for government services and demonstrates how agile delivery and user research can make life-changing improvements.    "
        },
        {
            "heading": 2,
            "text": "A central payment solution   "
        },
        {
            "text": "Earlier this year, we delivered the transition to Gov Pay as the central government payment solution for our services. This move aligns us with a cross-government standard, aiming to give customers a streamlined and trusted experience across departments.   "
        },
        {
            "text": "By enabling Apple Pay and Google Pay, we’ve added flexibility and convenience, making transactions faster and easier for mobile users. This project was made possible through close collaboration across our digital teams, which worked together to integrate systems, share expertise, and overcome technical challenges.   "
        },
        {
            "text": "The project not only delivered benefits for customers but also created valuable learning and development opportunities for colleagues, strengthening our capability for future digital transformation.   "
        },
        {
            "heading": 2,
            "text": "A significant milestone for our MOT service   "
        },
        {
            "text": "Our MOT reminder service reached a major milestone this year, with over 6 million motorists now signed up to receive free text or email alerts before their MOT is due.   "
        },
        {
            "text": "This simple yet powerful tool has significantly improved compliance rates – helping millions of people keep their vehicles roadworthy and safe. Importantly, by allowing subscribers to select text or email updates, the service is accessible to motorists with even basic levels of digital literacy.   "
        },
        {
            "heading": 2,
            "text": "What’s next?   "
        },
        {
            "text": "2026 is set to be another busy year for us at DVSA, as we continue to work on the recently announced changes to the driving test booking system. Our teams are working at pace to design, build and deliver improvements to the current system following extensive consultation with our customers and the driver training industry. The aim is to make it a seamless experience for everyone involved.   "
        },
        {
            "text": "This transformational work will be completed in partnership with the Department for Transport (DfT ) and the Driver and Vehicle Licensing Agency (DVLA). It will involve us collaborating with other government  departments such as Department for Science, Innovation and Technology (DSIT)  in support of  the Government’s roadmap for modern digital government.  This will  make our services easier, faster and more reliable for all  and  is part of our commitment to design modern, digital services that meet our customers’ needs.   "
        },
        {
            "text": "We’ll  be sharing more on this exciting work in the coming weeks.   "
        },
        {
            "heading": 2,
            "text": "Reflection   "
        },
        {
            "text": "These highlights reflect our dedication to accessibility, agility, and building future-ready systems.  And as we begin the new year, we’ll continue to embrace agile delivery, user-centred design and modern technology platforms to transform road safety services for millions of people.    "
        },
        {
            "text": "Keep an eye on our channels for part 2 of this blog series,  where we’ll  be sharing further insights from behind the scenes of our digital teams.   "
        },
        {
            "text": "You can also follow us on social media , subscribe to this blog channel  to keep up to date with the latest news from DVSA Digital and Data and sign up to receive email alerts  for opportunities to join our team.   "
        }
    ]
}