{
    "url": "https://ssac.blog.gov.uk/2026/02/09/from-parity-to-policy-the-northern-ireland-approach-to-social-security/",
    "title": "From Parity to Policy: The Northern Ireland Approach to Social Security",
    "authors": [
        "Les Allamby"
    ],
    "categories": [
        "Department for Communities (Northern Ireland)",
        "Northern Ireland",
        "social security"
    ],
    "pub_date": "2026-02-09T18:59:53+00:00",
    "content": [
        {
            "text": "The role of the Northern Ireland member of the Social Security Advisory Committee is twofold. First, to contribute to the Committee’s work in general including scrutinising regulations, involvement in the independent research work and wider engagement with stakeholders. Second, to shine a light on the particular circumstances in Northern Ireland, and the impact this has for social security policy and legislation. Our advice to Ministers is enriched by stakeholder meetings and operational visits, both of which have enormous value in providing a wide range of experience and insights.  I was therefore delighted to be part of a visit to Belfast alongside Committee colleagues Dr Stephen Brien and Rachel Chiu for a series of discussions with the Department for Communities (NI), the Northern Ireland Assembly Communities Committee and a range of other valued stakeholders."
        },
        {
            "text": "Social security has been a devolved issue in Northern Ireland for more than a century. The current arrangements are recognised in Section 87 of the Northern Ireland Act 1998 which effectively requires the Secretary of State for Work and Pensions and counterpart at the Department for Communities (NI) to consult with each other with a view to securing single systems of social security, child support and pensions for the UK. The commitment to co-ordination (more often referred to as the parity principle) is bolstered by the ‘Treasury’s Statement of Funding Policy: Funding the Scottish Government, Welsh Government and Northern Ireland Executive’. The latest statement from June 2025 outlines that where the: ‘Northern Ireland Executive’s welfare programmes mirror the equivalent programmes in Great Britain, the UK government will fund the costs. If the Northern Ireland Executive opts to make these programmes more generous then they will need to meet the additional costs’ (para 7.16).In effect, if Northern Ireland wants to do something different it must pay for it including where applicable any workarounds or changes needed to the IT systems which are relied on by the Department for Communities (NI) for delivery of most of its social security provision. This has meant that despite having greater devolved powers than in Scotland, the NI Executive has not moved as far from the principle of parity. Nonetheless, there are significant differences. In 2012 a Welfare Reform Bill equivalent to the Welfare Reform Act in Britain, which introduced significant cuts to social security, did not get through the NI Assembly after being blocked by Sinn Fein and other political parties. The UK government’s response was to work out the savings foregone and to reduce the block grant paid to Northern Ireland by a similar sum. The impasse was finally resolved in the Fresh Start Agreement in 2015 with the Northern Ireland legislation being fast tracked through Westminster Parliament alongside equivalent legislation to the Welfare Reform and Work Act."
        },
        {
            "text": "One outworking of the Fresh Start Agreement was that an independent panel was set up by the NI Executive with an agreed budget to recommend social security mitigations. As a result, the ‘bedroom tax’ and ‘benefit cap’ while part of the Northern Ireland legislation were mitigated.  Moreover, welfare support payments were introduced to provide claimants adversely affected by the move from Disability Living Allowance to Personal Independence Payment (PIP), the curtailment of contributory Employment and “Support Allowance to 12 months save for those in the support group and other changes all received payments for a defined period to provide a soft landing. In addition, a Discretionary Support scheme was set up to replace the Social Fund providing grants and interest free loans for furniture and household goods and other needs to claimants including those not on means-tested benefits but below an annual income threshold. The scheme also offers a Universal Credit New Claims Grant to tide over claimants struggling to manage the five week wait for a first Universal Credit payment. A second commissioned independent mitigations review published in autumn 2022 recommended a further series of mitigations, however this review did not have an agreed budget in advance and its recommendations have remained largely unrealised."
        },
        {
            "text": "Other differences that apply to Universal Credit are that UC is normally paid  twice monthly automatically and the housing costs element normally goes direct to the landlord rather than claimants having to request alternative payment arrangements or, in Scotland, having to seek to access the ‘Scottish choices’ scheme."
        },
        {
            "text": "The other dimension that the Northern Ireland member brings to the table is knowledge of the different social and economic backdrop critical to social security legislation and policy and its specific impact. Outside of social security support for childcare Northern Ireland lags way behind the rest of the UK in providing additional support, while there are significantly higher numbers per head of population claiming PIP, particularly on grounds of mental health issues. The rate of economic inactivity is much higher with over one in four people of working age neither in work nor actively seeking work. Moreover, the percentage gap between those with disabilities in work and those without is substantially greater than elsewhere in the UK."
        },
        {
            "text": "In practice, these issues were thrown into sharp relief during our recent visit by the Committee to Northern Ireland, where we met senior officials in the Department for Communities, the DUP Minister for Communities Gordon Lyons, the Northern Ireland Assembly Communities Committee and advice sector representatives from Advice NI and the Law Centre. The Communities Committee was focussing on employment programmes including a number of innovative interventions, how work coaches operated in practice for example:"
        },
        {
            "text": "It is clear that successful employment programmes need to be scaled up. However, one problem is that under the Barnett funding formula additional funding for employment programmes which is transferred from HM Treasury to the NI Executive goes into the general pot and depending on political priorities does not necessarily end up with the Department for Communities."
        },
        {
            "text": "Such visits help illustrate why keeping abreast of the application of devolved powers in social security is important when thinking about UK social security policy as a whole as Northern Ireland can be a test bed for important initiatives while its specific context may mean that simply following parity can have different practical ramifications than elsewhere across the Irish Sea."
        }
    ]
}