{
    "url": "https://naturalengland.blog.gov.uk/2026/02/09/hinkley-point-c-supporting-sustainable-growth-and-restoring-the-severn-estuary/",
    "title": "Hinkley Point C - Supporting Sustainable Growth and Restoring the Severn Estuary",
    "authors": [
        "Dave Slater"
    ],
    "categories": [
        "Development",
        "Growth",
        "Natural England"
    ],
    "pub_date": "2026-02-09T17:45:55+00:00",
    "content": [
        {
            "text": "By Dave Slater, NE Regional Director for the South West"
        },
        {
            "text": "Hinkley Point C will be the UK's largest nuclear power station, providing low-carbon energy to millions of homes. But building it in the Severn Estuary, one of Britain's most important habitats for fish and marine life, brings significant environmental challenges. In this blog, we explain how Natural England and our partners are working with EDF to ensure the power station can be built while protecting the estuary's wildlife, to find practical solutions to prevent millions of fish being harmed by the plant's water-cooling intakes."
        },
        {
            "heading": 4,
            "text": "Nature and Marine Life in The Severn Estuary  "
        },
        {
            "text": "The Severn Estuary is one of the most dynamic natural environments in the UK. It has the world’s second largest tidal range and is both a hub for economic development and home to unique ecosystems that support a wide array of fish and marine life."
        },
        {
            "text": "The Severn Estuary has the highest recorded number of fish species in the UK and is the nursery ground for many of the young fish that our fishing industry depends on. The estuary also plays a crucial role in the lifecycle of a range of endangered migratory fish species including Atlantic Salmon. It is for these reasons that the estuary and some of its species are protected by law."
        },
        {
            "heading": 4,
            "text": "Severn  Estuary  Vision "
        },
        {
            "text": "The shared goal of the Severn Estuary Partnership - a group including local authorities, the fishing industry, Natural England and a range of other stakeholders - is to have a nuclear power station that meets this country’s world-leading nuclear safety and environmental protection requirements alongside a restored and healthy functioning Severn Estuary, with thriving internationally important wildlife, habitats and landscapes that supports economic growth. "
        },
        {
            "text": "Long-term economic development here isn’t possible without transforming the estuary into a natural powerhouse with development that sustains and enhances the estuary’s resources. Restoring the Severn Estuary will provide benefits that go far beyond wildlife, providing benefits for people, local communities, and economies, including a greater resilience to the challenges of climate change."
        },
        {
            "heading": 4,
            "text": "Working together on sustainable growth, protecting nature and the environment"
        },
        {
            "text": "Hinkley Point C absolutely fits into that sustainable growth vision which is why Natural England, the Environment Agency, Natural Resources Wales and the Marine Management Organisation have been working together to enable EDF to build Hinkley Point C and to help meet our need for low carbon and secure energy while protecting the environment."
        },
        {
            "text": "Nuclear power stations require a huge amount of water for cooling. At Hinkley Point C, 132 cubic metres of water will need to be sucked up from the estuary every second to cool the turbine condensers. This is the equivalent to drawing 190 Olympic-sized swimming pools full of water from the estuary every hour. EDF estimate that over 7 million fish will be drawn into the intakes annually, and it is expected that around 2.6 million a year are likely to die as a result. As such, putting in place these measures is essential for preventing serious consequences for protected fish populations in our waters and impacts on the fishing industry."
        },
        {
            "text": "Migratory fish populations rely on the Severn Estuary for their survival and the estuary is a vital nursery for marine fish in the west of England. This includes Atlantic salmon which are now classed as endangered following a population crash of nearly 50% in the UK over the last twenty years. A practical solution needs to be found."
        },
        {
            "heading": 4,
            "text": "Science and Collaboration in Action "
        },
        {
            "text": "Several options have been explored, including removing weirs and creating saltmarshes to boost fish populations in the estuary and help offset the impact of the water intakes. EDF have decided to pursue the option of installing an acoustic fish deterrent– a device that will use sound to guide fish and other marine life away from the intakes to stop them being drawn into Hinkley’s cooling system. "
        },
        {
            "text": "While Acoustic Fish Deterrents are untested in this kind of environment, we have been really encouraged by the data that is emerging around their effectiveness. Continued testing monitoring and adaptation of the system will be needed over the coming years if we are to build our confidence that impacts on fish populations over time will be avoided. This evidence is vital to explore whether further mitigation would be required."
        },
        {
            "heading": 4,
            "text": "Looking Ahead  "
        },
        {
            "text": "By combining good science with strong partnerships, we can deliver critical infrastructure and safeguard the environment. We will continue to work with EDF and partners to deliver the green energy this country needs, protect this special habitat and the livelihoods that depend on it."
        },
        {
            "text": "You can read more about how Natural England’s new Strategy is recovering nature for growth, health and security here: Building Britain's Future: Why Nature and Growth Go Hand in Hand. "
        },
        {
            "text": "Read about the Environment Agency’s role and work regulating Hinkley Point:  Hinkley Point: nuclear regulation - GOV.UK "
        }
    ]
}