{
    "url": "https://digitaltrade.blog.gov.uk/2026/02/09/how-breaking-the-routine-fuels-fresh-ideas-and-delivers-value/",
    "title": "How breaking the routine fuels fresh ideas and delivers value",
    "authors": [
        "Jo Pitches, Senior Delivery Manager"
    ],
    "categories": [
        "People"
    ],
    "pub_date": "2026-02-09T11:38:54+00:00",
    "content": [
        {
            "heading": 2,
            "text": "Firebreak week at DBT "
        },
        {
            "text": "Every 3 months, teams in DBT Digital and Data and Technology are free to disband for a week to allow time for people to experiment with new ideas that deliver value to users. Firebreak week gives teams space to experiment. That experimentation leads to improvements for the public and for colleagues. "
        },
        {
            "text": "A pitching session takes place 2 to 3 days before Firebreak week. Anyone with an idea presents to the rest of the directorate, seeking recruits for their mini project.  "
        },
        {
            "text": "The range of projects pitched and worked on is varied, with subjects spanning content, data, technology and more. "
        },
        {
            "text": "Since the first Firebreak week took place in 2020, more than 500 projects have been pitched and more than 200 have been completed. "
        },
        {
            "text": "Value has been delivered in all sorts of ways.  "
        },
        {
            "text": "One research-based project stemmed from an ask from the Parental Leave policy team. According to Senior User Researcher, Laura Wood, this team had 18 months to deliver new policies as part of the Government’s ‘Make Work Pay’ initiative. "
        },
        {
            "text": "Laura's Firebreak Team provided the policy team with a clearer, evidence‑based understanding of the challenges parents face across the end‑to‑end leave journey. "
        },
        {
            "heading": 2,
            "text": "Inside Firebreak week "
        },
        {
            "text": "I followed 3 participants through the most recent Firebreak week last month. My aim was to find out what Firebreak means to them, and what value their participation brings, both personally and to internal or external users. "
        },
        {
            "text": "“Firebreak is a great opportunity to explore something you’re interested in,” explains Senior Content Designer, Etain Ní Fhearghail. “Maybe there’s something that bothers you, or that doesn’t sit neatly within your current roadmap or job role.”  "
        },
        {
            "text": "She believes Firebreak is a great way to investigate issues and to understand more about the environments, problems or users you’re working with. It also offers an opportunity to meet and work with people you don’t normally interact with. "
        },
        {
            "text": "“I really love it,” Principle Data Engineer, Michal Charemza says. “I get to indulge my interests while still providing value for the department or wider public. "
        },
        {
            "text": "“It’s an extremely empowering perk of working here.” "
        },
        {
            "text": "Having joined DBT recently, this was Product Manager, Fathima Mukadam’s first introduction to Firebreak.  "
        },
        {
            "text": "“I thought it was a brilliant concept and a way to break down silos by teams working with others and learning more about what’s going on in different portfolios,” she says. “It’s also a great opportunity to practice or develop new skills outside business as usual.”  "
        },
        {
            "heading": 2,
            "text": "Variety is the spice of Firebreak "
        },
        {
            "text": "All sorts of projects take place during Firebreak week. "
        },
        {
            "text": "Etain’s team looked at different ways to approach content on Business.gov.uk.  "
        },
        {
            "text": " “Firebreak gave us an opportunity to evaluate the current content ecosystem and explore what we could do differently to deliver better experiences for external visitors to the site, as well as internal users publishing content on it.” "
        },
        {
            "text": "Etain worked with people she wasn’t familiar with, enabling a fresh perspective. "
        },
        {
            "text": "“It was great to get input from people outside the Business Growth bubble who aren’t as close to the work and could act as critical friends,” she adds. "
        },
        {
            "text": "Michal’s team chose to focus predominantly on improving some newly open-source repositories. Fathima worked on 2 Firebreak projects. Her own team pitched one exploring how free text comments could be analysed without the need for manual data validation. "
        },
        {
            "text": "However, she also wanted to try working on something outside of her usual remit with people she hadn’t worked with before.  "
        },
        {
            "text": "She joined a team who wanted to create a ‘proof of concept’ tube‑style map to help navigate and explain how key parts of the Data Workspace platform fit together. It would concentrate on the flow of data and code between components. "
        },
        {
            "text": "“As someone who's unfamiliar with Data Workspace, I thought this could be a great way to learn more about it and see the design process unfold,” she explains. "
        },
        {
            "heading": 2,
            "text": "What was Firebreak week like? "
        },
        {
            "text": "Not entirely without challenges, but participants experienced and delivered a range of benefits. "
        },
        {
            "text": "“Firebreak was intense,” exclaims Etain. “There were a lot of ideas and workflows bouncing around the team. We probably picked too large a slice of pie for such a short time-boxed exercise, but there was real enthusiasm within the team to explore the topic.  "
        },
        {
            "text": "“I think it’s given us a real appetite to prioritise this work as the right thing to do for [both internal and external] users.” "
        },
        {
            "text": "For Michal the main challenge was balancing Firebreak-related work with urgent day-to-day issues that cropped up during the week. "
        },
        {
            "text": "Nevertheless, his Firebreak week was a success. "
        },
        {
            "text": "“I’m back to being proud of what we do in terms of open-source repositories,” he says.  "
        },
        {
            "text": "Better still, a member of the public took the time to try to improve one of the projects.  "
        },
        {
            "text": "“That sort of engagement and collaboration with the public is exactly what I think our open-source projects should encourage,” Michal adds. "
        },
        {
            "text": "Fathima found time the biggest challenge.  "
        },
        {
            "text": "“We would have loved to get more feedback and be able to use this to iterate the map,” she explains. “However, the aim was to create a proof of concept, and we felt this was accomplished.” "
        },
        {
            "text": "Her team will hand over the latest version of the map and all their findings to the Data Workspace Team to improve and take forward.  "
        },
        {
            "text": "Meanwhile, her free text comment project team have decided to continue iterating the work done.  "
        },
        {
            "heading": 2,
            "text": "Why host a Firebreak? "
        },
        {
            "text": "For anyone questioning whether Firebreak week is a strategically sensible initiative to hold, Director of Digital, Data and Technology,  Jason Kitcat can reassure them. "
        },
        {
            "text": "“Firebreak is a way for us to support innovation and learning and development,” Jason says. “All the work done is related to departmental objectives so it's relevant and important. It is a practice used in many other public bodies.” "
        },
        {
            "heading": 2,
            "text": "Who can get involved? "
        },
        {
            "text": "Understandably, some people may have reservations about getting involved in Firebreak week.  "
        },
        {
            "text": "Clearly there’s support from leadership. But what if your idea seems silly? Maybe you feel you don’t have the right skills? "
        },
        {
            "text": " “Nothing is too small, and it’s fine to go outside your wheelhouse,” reassures Michal. “I’m not a content or graphical designer, but I took it upon myself to do light bits of both for our documentation.” "
        },
        {
            "text": "Etain points out that Firebreak is often seen as a purely technical exercise, requiring data or development skills, but that’s not the case. "
        },
        {
            "text": "“I’d massively encourage non-technical colleagues to submit pitches for Firebreak,” she says. “We’ve all got ideas for small improvements that would make a real difference to how we work. Firebreak’s an excellent opportunity to unpick these problems and find solutions.” "
        },
        {
            "text": "“Those pitching will be excited to have more hands on deck, so don’t be shy,” advises Fathima, “You can get involved whatever capacity works for you”. "
        },
        {
            "text": "She adds that you’re not limited to just one project and don’t need to give up an entire week.  "
        },
        {
            "text": "Even if you can only commit a couple of hours, have certain skills or want to gain particular experience, simply share this with project teams. This will enable them to make the best use of your time and skills, she says.  "
        },
        {
            "heading": 2,
            "text": "Bringing Firebreak to life "
        },
        {
            "text": "Firebreak week continues to show that giving people space to explore ideas leads to meaningful improvements for colleagues and for the public. The stories shared by Etain, Michal and Fathima show that you do not need to be technical, or have a fully‑formed plan, to take part. "
        },
        {
            "text": "Curiosity, collaboration and a willingness to try something new are enough to get started.  "
        },
        {
            "text": "If you want to join a digital organisation that supports this approach to innovation, explore roles in our team on Civil Service Jobs.  "
        },
        {
            "text": "Have you taken part in a Firebreak week or something similar? We would like to hear from you in the comments. "
        }
    ]
}