{
    "url": "https://rpc.blog.gov.uk/2026/02/09/independent-scrutiny-the-foundation-for-growth/",
    "title": "Independent scrutiny – the foundation for growth",
    "authors": [
        "Stephen Gibson, RPC Chair"
    ],
    "categories": [
        "Growth mission"
    ],
    "pub_date": "2026-02-09T09:53:09+00:00",
    "content": [
        {
            "text": "This is the first post in a new series on ‘Why the RPC matters’ from our Chair, Stephen Gibson, explaining the importance of our independent scrutiny."
        },
        {
            "text": "Economic growth is this Government's number one mission, and as the Prime Minister’s Plan for Change makes clear: \"Growth can only be achieved in partnership with businesses.\" For that partnership to work, businesses need confidence that the regulatory environment won't hold them back with poorly evidenced or disproportionate burdens."
        },
        {
            "text": "That's where our independent scrutiny comes in."
        },
        {
            "text": "Reducing the burden of regulation isn't about having less regulation - it's about having better regulation. As the Secretary of State for Business and Trade, Peter Kyle acknowledged at October’s regional investment summit: \"When regulation is well designed and carefully implemented, it can promote growth and investment.\""
        },
        {
            "text": "This is precisely why the Regulatory Policy Committee exists."
        },
        {
            "text": "The RPC provides independent, evidence-based scrutiny of the government's impact assessments - ensuring that before any new regulation is introduced, its costs and benefits have been rigorously analysed and areas for improvement identified. Our work helps ensure that ministerial decisions are built on robust evidence, not assumptions or assertions."
        },
        {
            "text": "Independent scrutiny isn't a barrier to the government's growth agenda - it's essential infrastructure for delivering it. When the Secretary of State said he wants Britain to be \"the best place to start a business, grow a business, run a successful business and work in a thriving business, anywhere in Europe\" - that ambition requires regulation that is appropriate, proportionate and properly assessed."
        },
        {
            "text": "We stand ready to support that mission. The RPC is here to ensure that regulation promotes growth, is properly evidence-based and does not reduce investment or harm international competitiveness."
        },
        {
            "text": "Growth requires confidence. Confidence requires evidence. Evidence requires scrutiny."
        },
        {
            "text": "That's the case for independent regulatory oversight - not as a barrier to government activity, but as a foundation for effective action."
        },
        {
            "text": "🔗 Subscribe to our blog to learn more about how the RPC supports better regulation: https://rpc.blog.gov.uk/subscribe/"
        }
    ]
}