{
    "url": "https://gfie.blog.gov.uk/2026/02/09/opening-doors-with-the-dwp-social-mobility-apprenticeship/",
    "title": "Opening Doors with the DWP Social Mobility Apprenticeship",
    "authors": [
        "karlharvey1"
    ],
    "categories": [
        "Break down barriers to opportunity",
        "Life Chance Recruitment",
        "National Apprenticeship Week",
        "Social mobility",
        "Uncategorized"
    ],
    "pub_date": "2026-02-09T08:35:20+00:00",
    "content": [
        {
            "text": "In celebration of National Apprenticeship Week and embracing this year's theme of 'Skills for Life', we look at the positive impact apprenticeships have on individuals, and for the Civil Service by shining a spotlight on one of the GFiE Pathways changing lives: the DWP Social Mobility Apprenticeship (SMA) Pathway.\n\nHere is a look at how this Pathway brings new talent, perspective, and lived experience into the Civil Service.\n\n \nWhat the DWP Social Mobility Apprenticeship (SMA) Programme does\nAs part of the wider GFIE approach to inclusive recruitment, the DWP Social Mobility Apprenticeship helps people who might not access jobs through the usual route. It supports registered unemployed people and young people leaving school by offering an 18‑month role, with the chance to become permanent colleagues after 12 months.\nSMA gives the opportunity of paid work and gaining a nationally recognised qualification, such as:\n\nCustomer Service level 2 or 3\nBusiness Admin level 3\nCredit Controller and Collector level 2 or\nPublic Sector Compliance Officer level 3. \n\nDWP has successfully delivered this programme for over 13 years, offering over 3,000 Social Mobility apprenticeship opportunities to date, with many progressing into permanent Civil Service roles.\n\nSchool Leavers were added to the programme to help young people who had the prospect of leaving school without employment or training.\n\n29 school leavers have started across Counter Fraud and Debt Management, Disability Services and Retirement Services​\n36 roles are due to start in September 2026​.\n\n\nWho is eligible for SMA?\nCandidates need to be:\n\naged 16 and over and \nregistered unemployed, and\nhave limited work experience, low qualifications, or other complex barriers to work that could be removed by furthering their education and experience.\n\nFor School Leaver Apprenticeships candidates must be:\n\n16-19 years old and\nnot going onto further education, employment or training and \nthey must meet at least one of either from a low-income household, expectations of up to 7 qualifications from GCSEs or complex circumstances that create disadvantage. ​\n\n\nWhy is SMA important?\nSMA helps DWP to be more representative of the people we serve and supports the government skills and youth agenda. It enables us to bring new talent into DWP and helps support and develop the skills of people who would never have considered working in the Civil Service. \nDWP is the UK’s largest government department and the nature of the work we do means that we are in a privileged position to drive Social Mobility throughout the UK. This can be through our school advisors engaging with young people to our work coaches spotting potential in their caseload. \nWhich roles are offered through SMA?\n\nMost roles are across Operations but could also be in: \n\nCounter Fraud Compliance and Debt (CFCD)\nRetirement Services (RS) \nDisability Services (DS)\nPersonal Independence Payment (PIP) \nUniversal Credit (UC)\n\nTypical roles offered are: Work Coach, Case Manager, Case Review Agent, Fraud Officer, Debt Management Administrative Officer/Telephony and Software Engineer.\n\nHow do individuals apply?\nDWP Social Mobility Apprenticeships aren’t advertised externally to avoid disadvantaging people facing added barriers. When roles become available, these are shared with Jobcentre work coaches to find and nominate candidates from their caseloads. \nSchool Leaver Apprenticeships are not open directly to school leavers. When roles become available, they are advertised in schools and Pupil referral units by the Jobcentre Support for Schools Advisers in England.\nBy championing programmes like SMA as part of the GFIE Network, doors are opened for people who simply need the right opportunity and bring new talent, perspectives and lived experience into Government.\n\n\n"
        }
    ]
}